{"entity_string": "https://en.wikipedia.org/wiki/Steve_Jobs", "entity_url": "https://en.wikipedia.org/wiki/Steve_Jobs", "document": "Steven Paul Jobs, known as Steve Jobs, was an influential American business magnate, inventor, and investor. He was the co-founder, chairman, and CEO of Apple, as well as the founder, chairman, and CEO of NeXT. Jobs also played a significant role in the success of Pixar, where he served as the chairman and majority shareholder. His impact extended beyond these organizations, as he became a member of The Walt Disney Company's board of directors after Disney acquired Pixar. Jobs was a pioneer of the personal computer revolution in the 1970s and 1980s, alongside his colleague and Apple co-founder Steve Wozniak. Born to a Syrian father and German-American mother in San Francisco, Jobs was adopted shortly after his birth. Although his time at Reed College was fleeting, his contributions to the technology industry and his innovative spirit continue to shape the world today.", "noref_document": "Steve Jobs, the renowned co-founder of Apple Inc., was a visionary leader and technology pioneer. With his unmistakable style and relentless pursuit of perfection, Jobs revolutionized multiple industries, leaving an indelible mark on the world. Known for his passion for design and user-centric approach, he spearheaded the creation of groundbreaking products like the Macintosh computer, the iPod, iPhone, and iPad. Jobs' ability to seamlessly integrate hardware, software, and services set new standards and transformed Apple into one of the most influential companies globally. His innovative ideas and unwavering commitment to excellence continue to inspire generations of entrepreneurs and shape the future of technology.", "summary": "Steven Paul Jobs (born Abdul Lateef Jandali; February 24, 1955 – October 5, 2011) was an American business magnate, inventor, and investor. He was the co-founder, chairman, and CEO of Apple; the chairman and majority shareholder of Pixar; a member of The Walt Disney Company's board of directors following its acquisition of Pixar; and the founder, chairman, and CEO of NeXT. He was a pioneer of the personal computer revolution of the 1970s and 1980s, along with his early business partner and fellow Apple co-founder Steve Wozniak.\nJobs was born in San Francisco to a Syrian father and German-American mother. He was adopted shortly after his birth. Jobs attended Reed College in 1972 before withdrawing that same year."}
{"entity_string": "https://en.wikipedia.org/wiki/Whitney_Houston", "entity_url": "https://en.wikipedia.org/wiki/Whitney_Houston", "document": "Whitney Houston, known as \"the Voice,\" was an influential American singer and actress. With over 220 million records sold worldwide, she remains one of the best-selling music artists in history. In 2023, Rolling Stone recognized her as the second-greatest singer of all time. Houston's impactful singing style and exceptional vocal abilities influenced numerous artists in the popular music industry. Renowned for her commanding and soulful vocals, she skillfully incorporated gospel singing techniques into her pop music. With an impressive 11 number-one singles on the Billboard Hot 100, Houston holds the record for the only artist to achieve seven consecutive chart-topping singles.", "noref_document": "Whitney Houston, widely regarded as one of the greatest vocalists of all time, was an iconic singer, actress, and producer. Born in 1963, Houston began her music career in the 1980s and quickly rose to prominence with her powerful and soulful voice. She achieved extraordinary success, with numerous chart-topping hits and record-breaking album sales. Houston's ability to effortlessly transition between various music genres, including pop, R&B, and gospel, showcased her versatility and made her an influential figure in the music industry. Not only did she dominate the airwaves, but Houston also made her mark on the silver screen with her performances in films like \"The Bodyguard\" and \"Waiting to Exhale.\" Despite her remarkable achievements, Houston's personal life faced significant challenges, leading to tabloid scrutiny and occasional struggles with addiction. Nevertheless, her enduring legacy as an exceptional talent and her impact on the music industry continue to inspire generations of aspiring musicians.", "summary": "Whitney Elizabeth Houston (August 9, 1963 – February 11, 2012) was an American singer and actress. Nicknamed \"the Voice\", she is one of the best-selling music artists of all time, with over 220 million records sold worldwide. In 2023, Rolling Stone named her the second-greatest singer of all time. Houston influenced many singers in popular music, and was known for her powerful, soulful vocals, vocal improvisation skills, and use of gospel singing techniques in pop music. She had 11 number-one singles on the Billboard Hot 100 and is the only artist to have seven consecutive number-one singles on the chart."}
{"entity_string": "https://en.wikipedia.org/wiki/David_Bowie", "entity_url": "https://en.wikipedia.org/wiki/David_Bowie", "document": "David Bowie, born David Robert Jones, was an English singer, songwriter, musician, and actor who revolutionized the music industry. Throughout his career, he constantly reinvented himself, pushing the boundaries of sound and style. Bowie's innovative work during the 1970s left a lasting impact on popular music. He was not only acclaimed by critics and musicians but also regarded as one of the most influential musicians of the 20th century. Bowie's creativity extended beyond his music, as he incorporated visual presentation and staged performances into his art. From an early age, Bowie's passion for music became apparent, shaping his extraordinary journey in the world of entertainment.", "noref_document": "David Bowie, a renowned musician, actor, and cultural icon, left an indelible impact on the world of music and art. Born as David Robert Jones in 1947, Bowie rose to fame in the 1970s with his innovative and eclectic musical style, captivating audiences with his chameleon-like persona and genre-defying music. Throughout his career, he successfully reinvented himself with a series of alter egos, such as Ziggy Stardust and the Thin White Duke, pushing the boundaries of artistic expression. Bowie's music was characterized by its experimentation, blending genres like rock, pop, soul, and electronic music. With iconic albums like \"The Rise and Fall of Ziggy Stardust and the Spiders from Mars\" and \"Heroes,\" Bowie explored various themes, from space and science fiction to identity and sexuality. He not only influenced countless musicians across generations but also extended his creativity to acting with memorable performances in films like \"The Man Who Fell to Earth\" and \"Labyrinth.\" Bowie's enduring legacy continues to inspire and captivate audiences, cementing his status as one of the greatest innovators in popular culture.", "summary": "David Robert Jones (8 January 1947 – 10 January 2016), known professionally as David Bowie ( BOH-ee), was an English singer, songwriter, musician, and actor. A leading figure in the music industry, he is regarded as one of the most influential musicians of the 20th century. Bowie was acclaimed by critics and musicians, particularly for his innovative work during the 1970s. His career was marked by reinvention and visual presentation, and his music and stagecraft had a significant impact on popular music.\nBowie developed an interest in music from an early age."}
{"entity_string": "https://en.wikipedia.org/wiki/Prince_(musician)", "entity_url": "https://en.wikipedia.org/wiki/Prince_(musician)", "document": "Prince Rogers Nelson, better known as Prince, was a tremendously talented American artist who left an indelible mark on the music industry. With his flamboyant and androgynous persona, he captured the attention of audiences worldwide. Not only was he an incredible singer with a wide vocal range, including a distinctive falsetto and powerful screams, but he was also a skilled multi-instrumentalist. Prince often played all or most of the instruments on his own recordings, showcasing his versatility and musical genius. His music transcended genre boundaries, incorporating elements of funk, R&B, rock, new wave, soul, synth-pop, pop, jazz, blues, and hip hop. Moreover, Prince was a pioneer, producing his albums himself and famously giving birth to the Minneapolis sound. His contributions to the music world, coupled with his numerous awards and accolades, make him undeniably one of the greatest musicians of his generation.", "noref_document": "Prince, the legendary musician, was one of the greatest musical icons of the 20th century. With a distinct style that blended funk, rock, pop, and R&B, Prince captivated audiences with his mesmerizing performances and groundbreaking music. Known for his flamboyant personality and gender-bending fashion choices, he pushed the boundaries of artistry and sexuality in the music industry. With hit songs like \"Purple Rain,\" \"Kiss,\" and \"When Doves Cry,\" Prince established himself as an unparalleled artist and his music continues to influence generations of musicians to this day. Despite his untimely death in 2016, Prince's legacy lives on, reminding us of his extraordinary talent and the impact he made on the world of music.", "summary": "Prince Rogers Nelson (June 7, 1958 – April 21, 2016) was an American singer, songwriter, musician, record producer, and actor. The recipient of numerous awards and nominations, he is widely regarded as one of the greatest musicians of his generation. He was known for his flamboyant, androgynous persona; his wide vocal range, which included a far-reaching falsetto and high-pitched screams; and his skill as a multi-instrumentalist, often preferring to play all or most of the instruments on his recordings.  His music incorporated a wide variety of styles, including funk,  R&B,  rock,  new wave,  soul,  synth-pop,  pop,  jazz, blues, and hip hop. Prince produced his albums himself, pioneering the Minneapolis sound."}
{"entity_string": "https://en.wikipedia.org/wiki/Alan_Rickman", "entity_url": "https://en.wikipedia.org/wiki/Alan_Rickman", "document": "Alan Sidney Patrick Rickman, the renowned English actor and director, possessed a distinctive deep voice that captivated audiences worldwide. His talent was honed at the Royal Academy of Dramatic Art in London before joining the prestigious Royal Shakespeare Company. Rickman mesmerized audiences with his performances in both modern and classical theatre productions. Notably, he portrayed the Vicomte de Valmont in the production of Les Liaisons Dangereuses, receiving acclaim as the play transitioned from the RSC stage to the West End and eventually Broadway. In 1988, Rickman made his foray into film as the German terrorist leader Hans Gruber in Die Hard. Shortly after, he delivered a compelling portrayal of the Sheriff of Nottingham in Robin Hood: Prince of Thieves, winning the BAFTA Award for Best Actor in a Supporting Role.", "noref_document": "Alan Rickman was an iconic British actor, renowned for his remarkable stage presence and captivating film performances. Born in 1946 in London, Rickman began his career in theater and quickly made a name for himself with his commanding voice and ability to portray complex characters. He gained widespread recognition for his role as the villainous Hans Gruber in the action-packed film \"Die Hard\" (1988), which propelled him into international stardom. Throughout his career, Rickman portrayed a wide range of characters, from the enigmatic Severus Snape in the \"Harry Potter\" film series to the brooding Colonel Brandon in \"Sense and Sensibility\" (1995). With his distinctive voice, nuanced acting style, and notable filmography, Alan Rickman left an indelible mark on the world of entertainment and his legacy continues to inspire aspiring actors and fans alike.", "summary": "Alan Sidney Patrick Rickman (21 February 1946 – 14 January 2016) was an English actor and director. Known for his distinctive deep, languid voice, he trained at RADA (the Royal Academy of Dramatic Art) in London and became a member of the Royal Shakespeare Company (RSC), performing in modern and classical theatre productions. He played the Vicomte de Valmont in the RSC stage production of Les Liaisons Dangereuses in 1985, and after the production transferred to the West End in 1986 and Broadway in 1987, he was nominated for a Tony Award.\nRickman's first film role came when he was cast as the German terrorist leader Hans Gruber in Die Hard (1988). He appeared as the Sheriff of Nottingham in Robin Hood: Prince of Thieves (1991), for which he won the BAFTA Award for Best Actor in a Supporting Role."}
{"entity_string": "https://en.wikipedia.org/wiki/Robin_Williams", "entity_url": "https://en.wikipedia.org/wiki/Robin_Williams", "document": "Robin Williams, the legendary American actor and comedian, captivated audiences with his unparalleled improvisational skills and an incredible range of characters. He effortlessly created these characters on the spot, showcasing his comedic genius in both dramatic and comedic films. Recognized as one of the greatest comedians of all time, Williams received numerous accolades throughout his career. His talent earned him an Academy Award, two Primetime Emmy Awards, six Golden Globe Awards, two Screen Actors Guild Awards, and five Grammy Awards. Williams started his journey by performing stand-up comedy in San Francisco and Los Angeles during the mid-1970s. He also released several comedy albums, including \"Reality ... What a Concept\" in 1980.", "noref_document": "Robin Williams, the beloved American comedian and actor, left an indelible mark on the entertainment industry with his exceptional talent and magnetic personality. Williams effortlessly crafted unforgettable characters, from the zany alien Mork in \"Mork & Mindy\" to the iconic Mrs. Doubtfire. His improvisational skills and boundless energy brought laughter and joy to millions around the world. Beyond his comedic genius, Williams showcased his dramatic prowess in films such as \"Good Will Hunting,\" earning him an Academy Award for Best Supporting Actor. Despite his immense success, Williams battled with personal challenges, including mental health issues. His untimely death in 2014 was a devastating loss, leaving a void in the hearts of his fans and fellow artists alike. Nevertheless, Robin Williams' enduring legacy reminds us of the power of laughter, the importance of authentic connection, and the profound impact that a single individual can make on the lives of many.", "summary": "Robin McLaurin Williams (July 21, 1951 – August 11, 2014) was an American actor and comedian. Known for his improvisational skills and the wide variety of characters he created on the spur of the moment and portrayed on film, in dramas and comedies alike, he is regarded as one of the greatest comedians of all time. He received numerous accolades including an Academy Award, two Primetime Emmy Awards, six Golden Globe Awards, two Screen Actors Guild Awards, and five Grammy Awards.\nWilliams began performing stand-up comedy in San Francisco and Los Angeles during the mid-1970s, and released several comedy albums including Reality ... What a Concept in 1980."}
{"entity_string": "https://en.wikipedia.org/wiki/Carrie_Fisher", "entity_url": "https://en.wikipedia.org/wiki/Carrie_Fisher", "document": "Carrie Fisher, a renowned American actress and writer, left an indelible mark on the entertainment industry. Though she had a versatile career, Fisher is best remembered for her iconic portrayal of Princess Leia in the original Star Wars films. Her fiery personality and fearless demeanor resonated with audiences worldwide, making her a beloved figure in the Star Wars universe. Despite her tragic passing in 2016, Fisher's legacy endured as she posthumously appeared in subsequent Star Wars films. Beyond her Star Wars success, Fisher showcased her talent in various other movies like Shampoo, The Blues Brothers, When Harry Met Sally..., and The Women. Her remarkable performances earned her nominations for the Primetime Emmy Award for Outstanding Guest Actress. Carrie Fisher will always be remembered as a trailblazer and an inspiration to many in the entertainment industry.", "noref_document": "Carrie Fisher, the iconic actress, author, and advocate, is best known for her groundbreaking role as Princess Leia in the original Star Wars trilogy. Her portrayal of Leia Organa captivated audiences with her strength, intelligence, and determination, making her an empowering figure for many young women. Beyond her acting career, Fisher was also a talented writer, penning several bestselling novels and memoirs that showcased her wit and vulnerability. Additionally, she openly discussed her struggles with mental health and addiction, becoming a prominent advocate for reducing the stigma surrounding these issues. Fisher's impact and legacy extend far beyond the galaxy far, far away, as she continues to inspire and empower countless individuals with her honesty, humor, and resilience.", "summary": "Carrie Frances Fisher (October 21, 1956 – December 27, 2016) was an American actress and writer. She was best known for playing Princess Leia in the original Star Wars films (1977–1983). She reprised the role in Star Wars: The Force Awakens (2015), The Last Jedi (2017) — a posthumous release that was dedicated to her — and appeared in The Rise of Skywalker (2019), through the use of unreleased footage from The Force Awakens.Fisher's other film credits include Shampoo (1975), The Blues Brothers (1980), Hannah and Her Sisters (1986), The 'Burbs (1989), When Harry Met Sally... (1989), Soapdish (1991), and The Women (2008). She was nominated twice for the Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series for her performances in the NBC sitcom 30 Rock (2007) and the Channel 4 series Catastrophe (2017)."}
{"entity_string": "https://en.wikipedia.org/wiki/Chester_Bennington", "entity_url": "https://en.wikipedia.org/wiki/Chester_Bennington", "document": "Chester Charles Bennington, the talented American singer, made a significant impact as the lead vocalist of rock band Linkin Park. His powerful vocals and emotional lyrics captivated audiences worldwide, especially following the release of the band's debut album, Hybrid Theory, in 2000. This album achieved remarkable success, earning a Diamond certification and becoming one of the bestselling debut albums of the decade. Bennington's undeniable talent and contribution to Linkin Park continued throughout their discography, with each subsequent studio album charting in the top three spots of the Billboard 200. In addition to his work with Linkin Park, Bennington formed the band Dead by Sunrise in 2005, showcasing his versatility and passion for music.", "noref_document": "Chester Bennington, the legendary American singer, songwriter, and musician, was widely recognized as the lead vocalist for the rock band Linkin Park. Bennington's powerful and emotive voice served as the driving force behind the band's chart-topping hits and their unique blend of alternative rock, nu-metal, and electronic music. Known for his raw and intense lyrics, he brought a sense of vulnerability and authenticity to his performances, captivating audiences around the world. With his distinctive vocal range and ability to express deep emotional pain, Bennington became an icon for a generation of music lovers, leaving an indelible mark on the music industry before his untimely passing in 2017.", "summary": "Chester Charles Bennington (March 20, 1976 – July 20, 2017) was an American singer who served as the lead vocalist of rock band Linkin Park. He was also a lead vocalist of Grey Daze, Dead by Sunrise and Stone Temple Pilots at various points.\nBennington first gained prominence as a vocalist following the release of Linkin Park's debut album, Hybrid Theory (2000), which was a worldwide commercial success. The album was certified Diamond by the Recording Industry Association of America in 2005, making it the bestselling debut album of the decade, as well as one of the few albums ever to achieve that many sales. He continued to serve as the band's lead vocalist for their next six studio albums, from Meteora (2003) to One More Light (2017), with each charting within the top three spots of the Billboard 200.Bennington formed his own band, Dead by Sunrise, as a side project in 2005."}
{"entity_string": "https://en.wikipedia.org/wiki/Chris_Cornell", "entity_url": "https://en.wikipedia.org/wiki/Chris_Cornell", "document": "Chris Cornell was an American singer, songwriter, and musician who made a significant impact on the rock music scene. As the lead vocalist, rhythm guitarist, and primary lyricist for the renowned rock bands Soundgarden and Audioslave, Cornell showcased his immense talent, captivating audiences with his powerful vocal belting technique and his nearly four-octave vocal range. Apart from his work with these bands, Cornell had a successful solo career and contributed to various movie soundtracks. He founded Temple of the Dog as a tribute band to his late friend Andrew Wood, further showcasing his musical versatility and his ability to connect with fans on a deeper level. Cornell's contributions to the grunge movement of the 1990s solidified his status as one of the greatest rock singers of all time.", "noref_document": "Chris Cornell was an iconic American singer, songwriter, and musician. He was best known as the lead vocalist for the bands Soundgarden and Audioslave, and his powerful voice and unique songwriting style made him one of the most influential figures in the grunge and alternative rock movements of the 1990s. With a four-octave vocal range, Cornell captivated audiences with his soulful and often introspective lyrics. Throughout his career, he released several successful solo albums and collaborated with numerous artists, further cementing his reputation as a versatile and talented musician. Unfortunately, Cornell tragically passed away in 2017, but his impact on the music world continues to be celebrated and cherished.", "summary": "Christopher John Cornell (né Boyle; July 20, 1964 – May 18, 2017) was an American singer, songwriter and musician best known as the lead vocalist, rhythm guitarist, and primary lyricist for the rock bands Soundgarden and Audioslave. He also had a solo career and contributed to numerous movie soundtracks. Cornell was the founder and frontman of Temple of the Dog, a one-off tribute band dedicated to his late friend Andrew Wood. Several music journalists, fan polls and fellow musicians have regarded Cornell as one of the greatest rock singers of all time.Cornell is considered one of the key figures of the 1990s grunge movement. He is well known for his extensive catalog as a songwriter, his nearly four-octave vocal range, and his powerful vocal belting technique."}
{"entity_string": "https://en.wikipedia.org/wiki/Avicii", "entity_url": "https://en.wikipedia.org/wiki/Avicii", "document": "Avicii, the professional name of Tim Bergling, was more than just a DJ, remixer, and music producer—he was a trailblazer in the electronic music scene. The Swedish artist first gained attention at a young age by sharing his remixes on electronic music forums. The recognition led to a record deal, launching his career to new heights. Avicii's breakthrough single \"Levels\" propelled him to stardom in 2011, and he continued to push boundaries with his debut studio album, True. With its blend of electronic music and diverse genres, the album garnered positive reviews and achieved commercial success worldwide. One of its standout tracks, \"Wake Me Up,\" secured the number one spot in numerous European music markets and reached number four in the United States. Avicii's contributions to the music industry will be remembered and celebrated for years to come.", "noref_document": "Avicii was a Swedish musician, DJ, and record producer known for his innovative and influential contributions to electronic dance music. His unique sound blended catchy melodies, infectious beats, and emotive lyrics, creating a distinct fusion of pop and EDM. With chart-topping hits like \"Wake Me Up\" and \"Levels,\" Avicii brought EDM into the mainstream, captivating audiences worldwide. However, beyond his commercial success, Avicii also struggled with mental health issues and the pressures of fame. His untimely death in 2018 served as a tragic reminder of the toll that the music industry can take on artists. Nonetheless, Avicii's impact on the world of electronic music remains profound, and his legacy continues to inspire aspiring musicians and fans alike to push boundaries and express themselves through the power of music.", "summary": "Tim Bergling (Swedish: [ˈtɪmː ˈbæ̂rjlɪŋ] ; 8 September 1989 – 20 April 2018), known professionally as Avicii ( ə-VEE-chee, Swedish: [aˈvɪ̌tːɕɪ]), was a Swedish DJ, remixer, and music producer. At age 16, Bergling began posting his remixes on electronic music forums, which led to his first record deal. He rose to prominence in 2011 with his single \"Levels\". His debut studio album, True (2013), blended electronic music with elements of multiple genres and received generally positive reviews. It peaked in the top 10 in more than 15 countries and topped international charts; the lead single, \"Wake Me Up\", topped most music markets in Europe and reached number four in the United States."}
{"entity_string": "https://en.wikipedia.org/wiki/Pebble_(watch)", "entity_url": "https://en.wikipedia.org/wiki/Pebble_(watch)", "document": "Pebble, the popular smartwatch developed by Pebble Technology Corporation, made history when it raised an impressive $10.3 million through a Kickstarter campaign. This made it the most funded project on Kickstarter at the time. Following the successful funding, Pebble started shipping their watches to Kickstarter backers in January 2013. Compatible with both Android and iOS devices, Pebble watches allowed users to conveniently receive notifications and messages. To cater to various needs, an online app store offered a wide range of Pebble-compatible apps developed by ESPN, Uber, Runkeeper, GoPro, and many others. Despite being discontinued, Pebble made a notable impact in the world of wearable technology.", "noref_document": "Pebble is a name that has become synonymous with smartwatches. Launched in 2013, Pebble quickly gained popularity for its innovative approach to wearable technology. The company's watches boasted an electronic paper display, ensuring a long-lasting battery life of up to one week. Compatible with both Android and iOS devices, Pebble watches offered a range of features, including activity tracking, notifications, and music control. Additionally, the watches allowed users to customize their appearance through interchangeable watchfaces and bands. With the support of a dedicated community of developers, Pebble's ecosystem grew rapidly, offering a wide array of third-party apps and watchfaces. Despite Pebble's eventual demise in 2016, the brand left a lasting impact on the smartwatch industry, paving the way for future advancements in wearable technology.", "summary": "Pebble is a discontinued smartwatch developed by Pebble Technology Corporation. Funding was conducted through a Kickstarter campaign running from April 11, 2012, to May 18, 2012, which raised $10.3 million; it was the most funded project in Kickstarter history, at the time. Pebble began shipping watches to Kickstarter backers in January 2013. Pebble watches can be connected to Android and iOS devices to show notifications and messages. An online app store distributed Pebble-compatible apps from many developers including ESPN, Uber, Runkeeper, and GoPro."}
{"entity_string": "https://en.wikipedia.org/wiki/Vine_(service)", "entity_url": "https://en.wikipedia.org/wiki/Vine_(service)", "document": "Vine, a popular American short-form video hosting service, allowed users to share six-second-long looping video clips. Launched in 2013 by Vine Labs, Inc., it was acquired by Twitter, Inc. even before its official release. Sadly, Vine was shut down in 2017, with the discontinuation of its app a few months later. The service provided the option to share videos on various social networking platforms like Facebook and Twitter. Users could also explore themed groups of videos, hoping to see their own creations \"trend.\"", "noref_document": "Vine was a short-form video hosting service that allowed users to share and watch six-second looping video clips. It quickly gained popularity as a platform for creative expression, with users showcasing their talents, humor, and storytelling abilities in compact and captivating videos. Vine provided a space for aspiring content creators to build a following and collaborate with others, and it paved the way for the rise of internet personalities and influencers. The app was known for its vibrant and diverse community, where users could discover and engage with a wide range of content, from comedy skits and music performances to DIY tutorials and mesmerizing visual effects. Although Vine was discontinued in 2017, its impact on internet culture and the way we consume and create content continues to resonate.", "summary": "Vine was an American short-form video hosting service where users could share six-second-long looping video clips. It was originally launched on January 24, 2013, by Vine Labs, Inc. Bought by Twitter, Inc. in 2012 before its launch, the service was shut down on January 17, 2017, and the app was discontinued a few months later.Videos published on Vine's social network could also be shared on different social networking platforms such as Facebook and Twitter. The Vine app was also used to browse videos, along with a group of videos that were uploaded by theme, and hoping that users could \"trend\" videos."}
{"entity_string": "https://en.wikipedia.org/wiki/Rdio", "entity_url": "https://en.wikipedia.org/wiki/Rdio", "document": "Rdio, a once popular online music streaming service, provided users with the ability to stream music for free with ads, or subscribe for an ad-free experience. With availability in 85 countries, it offered various platforms such as Android, iOS, Windows Phone, and even systems like Roku and Sonos. Users could stream music directly from Rdio's servers or download content for offline playback. Additionally, Rdio had a desktop client application for both OS X and Windows, along with a Windows Store application. Its impressive library included content from major record labels, as well as the Merlin Network and several aggregators. Moreover, Rdio incorporated social networking features, allowing users to share their favorite songs, albums, and playlists on Rdio and other platforms like Facebook and Twitter. Although Rdio faced financial troubles and filed for bankruptcy in 2015, it managed to sell certain intellectual property to Pandora Radio.", "noref_document": "Rdio is a music streaming service that was founded in 2008 and gained popularity for its vast library of songs and user-friendly interface. It allowed users to discover and listen to a wide range of music from various genres, making it a beloved platform for music enthusiasts. Rdio also incorporated social features, allowing users to follow their friends and listen to their playlists, fostering a sense of community within the platform. Despite its early success, Rdio eventually faced financial challenges and filed for bankruptcy in 2015. However, its legacy lives on, as it paved the way for the development of other popular music streaming services like Spotify and Apple Music.", "summary": "Rdio (pronounced  \"r-dee-oh\") was an online music streaming service that offered ad-supported free streaming and ad-free subscription streaming services in 85 countries. It was available as a website and via app for Android, BlackBerry, iOS, and Windows Phone mobile devices, which could stream music from Rdio's servers or download music for offline playback; there were also clients for the Roku and Sonos systems. The web-based service also offered a native desktop client application for OS X and Windows, as well as a Windows Store application.Rdio's library had content from the four major record labels, as well as the Merlin Network and the aggregators BFM Digital, Catapult, CD Baby, boomertunes, INgrooves, and The Orchard. Rdio also offered social networking features, such as the ability to share songs, albums, and playlists with others on Rdio and social networks such as Facebook and Twitter.\nOn November 16, 2015, Rdio filed for Chapter 11 bankruptcy in which they had to pay $200 million and announced the sale of certain intellectual property to Pandora Radio."}
{"entity_string": "https://en.wikipedia.org/wiki/Yik_Yak", "entity_url": "https://en.wikipedia.org/wiki/Yik_Yak", "document": "Yik Yak, a pseudonymous social media smartphone application, initially launched in 2013 and relaunched in 2021. The app allows college students to engage in discussions within a 5-mile radius, termed \"Yaks.\" While it shares similarities with other anonymous sharing apps, Yik Yak distinguishes itself by focusing on sharing primarily with those nearby. Despite experiencing significant growth in its early years, the app faced heavy criticism for promoting racism, antisemitism, sexism, and cyberbullying. Consequently, user downloads plummeted in 2016, leading Yik Yak to announce its closure in April 2017.", "noref_document": "Yik Yak is a location-based social media platform that gained popularity among college students when it was first launched in 2013. It allowed users to anonymously create and view \"Yaks,\" short posts that could be upvoted or downvoted by others. This created a sense of community and real-time engagement, as users could see what was happening and being discussed around them. However, the app faced significant challenges due to issues with cyberbullying and harassment, leading to its eventual shutdown in 2017. Despite its controversies, Yik Yak served as a testament to the power of anonymous online communication and its impact on collective conversations.", "summary": "Yik Yak is a pseudonymous social media smartphone application that initially launched in 2013 and relaunched in 2021. The app, which is available for iOS and (formerly) Android, allows college students to create and view discussion threads within a 5-mile (8.0 km) radius (termed \"Yaks\" by the application). It is similar to other anonymous sharing apps such as Nearby, but differs from others such as Whisper in that it is intended for sharing primarily with those in proximity to the user.Despite strong levels of growth in 2013 and 2014, following several bouts of heavy criticism in the media over the dissemination of racism, antisemitism, sexism and the facilitation of cyber-bullying, the service saw stagnation in the growth of its user base. In 2016 alone, user downloads fell 76% compared to 2015. Failing to maintain user engagement, Yik Yak announced on April 28, 2017, that the service would close in the coming week."}
{"entity_string": "https://en.wikipedia.org/wiki/Theranos", "entity_url": "https://en.wikipedia.org/wiki/Theranos", "document": "Theranos Inc. was a once-promising health technology company founded in 2003 by Elizabeth Holmes. The company gained significant attention and raised over $700 million in funding, reaching a valuation of $10 billion. Theranos claimed to have developed breakthrough blood tests that required minimal blood samples and promised rapid and accurate results using their compact automated devices. However, these claims were later found to be false, leading to intense scrutiny and criticism. In 2015, doubts about Theranos's technology were raised by medical research professor John Ioannidis, clinical biochemistry professor Eleftherios Diamandis, and investigative journalist John Carreyrou of The Wall Street Journal. This revelation marked a turning point for the company.", "noref_document": "Theranos was a medical technology company founded in 2003 by Elizabeth Holmes. The company aimed to revolutionize the healthcare industry by offering a blood-testing device that required only a few drops of blood, promising faster results at a lower cost. However, concerns about the device's accuracy and reliability were raised, leading to an investigation by the U.S. Securities and Exchange Commission (SEC). Ultimately, in 2018, Theranos and Holmes settled with the SEC, and the company's operations were dissolved. The rise and fall of Theranos serve as a cautionary tale highlighting the importance of transparency and thorough validation in the development of groundbreaking technologies.", "summary": "Theranos Inc. () was an American privately held corporation that was touted as a breakthrough health technology company. Founded in 2003 by then 19-year-old Elizabeth Holmes, Theranos raised more than US$700 million from venture capitalists and private investors, resulting in a $10 billion valuation at its peak in 2013 and 2014. The company claimed that it had devised blood tests that required very small amounts of blood and that could be performed rapidly and accurately, all using compact automated devices which the company had developed. These claims were later proven to be false.A turning point came in 2015, when medical research professor John Ioannidis, and later professor of clinical biochemistry Eleftherios Diamandis, along with investigative journalist John Carreyrou of The Wall Street Journal, questioned the validity of Theranos's technology."}
{"entity_string": "https://en.wikipedia.org/wiki/Juicero", "entity_url": "https://en.wikipedia.org/wiki/Juicero", "document": "Juicero, an American company known for its innovative and tech-savvy approach to juicing, offered consumers a convenient way to enjoy freshly pressed fruit and vegetable juices. The star of their product lineup was the Juicero Press, a high-end pouring device equipped with Wi-Fi connectivity. What set Juicero apart was its proprietary single-serving packets of pre-chopped fruits and vegetables, which were exclusively sold through the company's subscription service. This unique system garnered significant attention from investors, securing the firm an impressive $120 million in venture capital. However, as the company faced slow sales, negative media coverage emerged when it was discovered that the expensive juicer was not necessary at all - the juice packets could be easily squeezed by hand. Ultimately, Juicero ceased operations in 2017 and began looking for a buyer for both the company and its valuable intellectual property.", "noref_document": "Juicero is a now-defunct company that was founded in 2013 and operated until 2017, with a focus on delivering fresh, cold-pressed juice to consumers in a convenient and innovative way. The company gained attention due to its proprietary juice press system, which utilized Wi-Fi connectivity and custom-designed packs of pre-cut fruits and vegetables. Customers could simply insert these packs into the press, and the machine would do the rest, producing a fresh glass of juice in seconds. Despite its initial success and investment from notable figures, Juicero faced controversy and criticism over the high price of both the machine and the juice packs, as some argued that the juice could be extracted by hand without the need for the expensive technology. Ultimately, these factors contributed to the downfall of Juicero, marking a cautionary tale in the world of food technology startups.", "summary": "Juicero was an American company that designed, manufactured and sold the Juicero Press, a fruit and vegetable pouring device. The Juicero Press featured Wi-Fi connectivity and used proprietary, single-serving packets of pre-chopped fruits and vegetables that were sold exclusively by the company by subscription. From 2014 to 2017, the San Francisco-based firm received $120 million in startup venture capital from investors.The company attracted significant negative media attention when consumers and journalists discovered that its juice packets could be squeezed just as easily by hand as by the company's expensive juicer. In 2017, following slow sales, the company ceased operations and announced it was seeking a buyer for the company and its intellectual property.\n\n\n== History ==\nJuicero was founded in 2013 by Doug Evans, who served as CEO until October 2016, when former president of Coca-Cola North America Jeff Dunn took over the position."}
{"entity_string": "https://en.wikipedia.org/wiki/Aereo", "entity_url": "https://en.wikipedia.org/wiki/Aereo", "document": "Aereo, a technology company based in New York City, revolutionized the way people accessed and consumed television content. Through their innovative platform, subscribers were able to watch live and time-shifted streams of over-the-air television on their Internet-connected devices. Launched in March 2012 with the backing of Barry Diller's IAC, Aereo quickly gained popularity among users seeking a more flexible and personalized viewing experience. However, their journey was met with a significant setback when on June 25, 2014, the Supreme Court ruled against them in a case presented by several broadcast networks. The court deemed that Aereo's business model violated copyright holders' rights, as it was viewed as a \"public performance\" without obtaining necessary permissions. This ruling, despite the technological distinctions, equated Aereo's services to those of traditional cable television providers, ultimately leading to their downfall.", "noref_document": "Aereo is a now-defunct American technology company that provided a subscription-based service for streaming live and time-shifted over-the-air television programs online. Founded in 2012, Aereo aimed to enable consumers to access broadcast television stations using individually assigned antennas housed in remote data centers. This innovative approach allowed users to watch and record live television on various internet-connected devices without requiring a cable or satellite TV subscription. However, due to legal challenges from broadcast networks, Aereo was eventually forced to suspend its operations in 2014, marking the end of its short-lived but groundbreaking venture.", "summary": "Aereo was a technology company based in New York City that allowed subscribers to view live and time-shifted streams of over-the-air television on Internet-connected devices. The service opened to customers in March 2012, and was backed by Barry Diller's IAC.On June 25, 2014, the Supreme Court ruled against Aereo in a case brought by several broadcast networks. The Court found that Aereo infringed upon the rights of copyright holders. The point of contention was whether Aereo's business model constituted a \"public performance\", which would legally require it to obtain permission from the copyright owners of any programs it transmits. The court ruled in a 6–3 decision that Aereo's business model was no different from that of a cable television provider, despite the differences in technology."}
{"entity_string": "https://en.wikipedia.org/wiki/Quibi", "entity_url": "https://en.wikipedia.org/wiki/Quibi", "document": "Quibi, the short-form streaming platform, made its mark in the entertainment industry by providing content specifically designed for mobile devices. Founded in Los Angeles as NewTV in 2018 by Jeffrey Katzenberg, and led by CEO Meg Whitman, the platform managed to secure an impressive $1.75 billion in funding. Despite a highly anticipated launch in April 2020, Quibi unfortunately struggled to meet its subscriber projections and ultimately shut down in December of the same year. However, in a deal worth less than $100 million, the platform's content library found a new home with Roku, Inc. in January 2021.", "noref_document": "Quibi, short for \"quick bites,\" is a short-form streaming platform that catered to mobile users by offering bite-sized entertainment content. Launched in April 2020, Quibi positioned itself as an innovative platform, creating original shows and movies specifically designed to be consumed on smartphones. Shows on Quibi were divided into episodes no longer than 10 minutes, allowing viewers to easily watch content during short breaks or commutes. With a wide range of genres and high-profile creators and actors involved, Quibi aimed to provide users with a quick and convenient way to access premium content on-the-go. Despite its star-studded lineup and significant investment, Quibi struggled to attract a substantial user base and ultimately shut down in December 2020.", "summary": "Quibi ( KWIB-ee) was an American short-form streaming platform that generated content for viewing on mobile devices. It was founded in Los Angeles in August 2018 as NewTV by Jeffrey Katzenberg and was led by Meg Whitman, its CEO. The service raised $1.75 billion from investors.  It launched in April 2020, but shut down in December 2020 after falling short of its subscriber projections. In January 2021, Quibi's content library was sold to Roku, Inc. for less than $100 million."}
{"entity_string": "https://en.wikipedia.org/wiki/Grooveshark", "entity_url": "https://en.wikipedia.org/wiki/Grooveshark", "document": "Grooveshark, an innovative web-based music streaming service, allowed users to upload and stream digital audio files while organizing them in personalized playlists. With a comprehensive search engine, music streaming capabilities, and a sophisticated music recommendation system, Grooveshark provided a unique platform for music enthusiasts. Despite facing legal battles, including a major lawsuit from Universal Music Group, the company successfully defended its right to use pre-1972 recordings. However, Grooveshark was also sued by EMI Music Publishing, Sony Music Entertainment, and Warner Music Group for copyright violations. Consequently, Apple and Facebook removed Grooveshark's applications from their respective platforms due to concerns regarding copyright issues.", "noref_document": "Grooveshark is a now-defunct online music streaming platform that was launched in 2007. It allowed users to search and share music files, creating personalized playlists and discovering new songs based on their tastes. Grooveshark amassed a vast library of music from various genres and artists, providing a convenient and accessible way for users to listen to their favorite tracks. However, due to legal challenges and copyright infringement issues, Grooveshark was forced to shut down in 2015. Despite its controversial history, Grooveshark remains an important part of the evolution of online music streaming platforms.", "summary": "Grooveshark was a web-based music streaming service owned and operated by Escape Media Group in the United States. Users could upload digital audio files, which could then be streamed and organized in playlists. The Grooveshark website had a search engine, music streaming features, and a music recommendation system.The company won a major lawsuit filed by Universal Music Group concerning use of Universal's pre-1972 recordings. Grooveshark was also sued for copyright violations by EMI Music Publishing, Sony Music Entertainment, and Warner Music Group. Concerns about copyrights led Apple and Facebook to remove Grooveshark's applications from the iOS App Store and Facebook platform respectively."}
{"entity_string": "https://en.wikipedia.org/wiki/Ouya", "entity_url": "https://en.wikipedia.org/wiki/Ouya", "document": "The Ouya, a microconsole developed by Ouya Inc, made its debut in 2012 under the leadership of Julie Uhrman. Uhrman enlisted the help of designer Yves Béhar and VP of Product Management Muffi Ghadiali to bring the project to life. Through a successful Kickstarter campaign, the development of Ouya was funded with a remarkable $8.5 million, making it one of the most successful projects in the crowdfunding platform's history. In 2013, the console began shipping to Kickstarter backers in March and was released to the public in June. Featuring an application store tailored specifically for Ouya-compatible games and apps, the platform primarily offered a wide range of casual games to its users.", "noref_document": "Ouya is a microconsole released in 2013 that aimed to revolutionize the gaming industry. Developed by the company of the same name, Ouya gained attention for its open-source approach and affordability. It believed in democratizing game development by providing an accessible platform for independent developers to create and share their games. With a focus on indie games and an online marketplace, Ouya provided a unique gaming experience for users seeking fresh and innovative titles. However, Ouya struggled to compete with more established gaming consoles and faced challenges in attracting a wide audience. Despite its eventual discontinuation in 2015, Ouya's impact on the gaming industry cannot be denied, as it inspired a new wave of microconsoles and highlighted the importance of indie game development.", "summary": "The Ouya ( OO-yə), stylized as OUYA, is an Android-based microconsole developed by Ouya Inc. Julie Uhrman founded the project in 2012, bringing in designer Yves Béhar to collaborate on its design and Muffi Ghadiali as VP of Product Management to put together the engineering team. Development was funded via Kickstarter, raising US$8.5 million, becoming one of the website's highest earning projects in its history.\nUnits started to ship to Kickstarter backers in March 2013 and were released to the general public in June 2013. It featured a store for applications and games designed specifically for the Ouya platform, the majority of which were casual games."}
{"entity_string": "https://en.wikipedia.org/wiki/Burj_Khalifa", "entity_url": "https://en.wikipedia.org/wiki/Burj_Khalifa", "document": "The Burj Khalifa, formerly known as the Burj Dubai, stands tall and proud in the vibrant city of Dubai, United Arab Emirates. Rising to a staggering height of 829.8 meters (2,722 feet), it commands attention as the world's tallest building. The Burj Khalifa's impressive architecture includes a 242.6-meter spire, bringing its roof height to 828 meters (2,717 feet), surpassing the previous record-holder, Taipei 101. The construction of this monumental structure began in 2004 and was completed in 2009, showcasing a seamless blend of reinforced concrete and structural steel sourced from the Palace of the Republic in East Berlin. Located in the captivating neighborhood of Downtown Dubai, the Burj Khalifa has become a symbol of modernity and innovation.", "noref_document": "The Burj Khalifa is a towering skyscraper located in Dubai, United Arab Emirates. As the tallest building in the world, it stands at an impressive height of 828 meters (2,717 feet) with 163 floors. The construction of this architectural marvel began in 2004 and was completed in 2010, symbolizing the rapid growth and innovation of Dubai. Apart from its breathtaking height, the Burj Khalifa features a unique design inspired by Islamic architecture, with setbacks that create a spiraling effect, giving it an iconic appearance. Besides being a prominent landmark, the Burj Khalifa serves multiple purposes, including offering luxurious residential spaces, housing corporate offices, and hosting a wide variety of amenities. With its observation deck on the 148th floor, it provides visitors with unmatched panoramic views of the city and surrounding areas. The Burj Khalifa stands as a testament to human ingenuity and engineering prowess, capturing the imagination of millions worldwide.", "summary": "The Burj Khalifa (known as the Burj Dubai prior to its inauguration in 2010) is a skyscraper in Dubai, United Arab Emirates. It is the world's tallest building. With a total height of 829.8 m (2,722 ft, or just over half a mile) and a roof height (excluding antenna, but including a 242.6 m spire) of 828 m (2,717 ft), the Burj Khalifa has been the tallest structure and building in the world since its topping out in 2009, supplanting Taipei 101, the previous holder of that status.Construction of the Burj Khalifa began in 2004, with the exterior completed five years later in 2009. The primary structure is reinforced concrete and some of the structural steel for the building originated from the Palace of the Republic in East Berlin, the former East German parliament. The building was opened in 2010 as part of a new development called Downtown Dubai."}
{"entity_string": "https://en.wikipedia.org/wiki/The_Shard", "entity_url": "https://en.wikipedia.org/wiki/The_Shard", "document": "The Shard, also known as the Shard London Bridge, is a remarkable 72-storey skyscraper located in Southwark, London. Designed by the renowned Italian architect Renzo Piano, it is the tallest building in the United Kingdom and Western Europe, standing at an impressive height of 309.6 metres (1,016 feet). The Shard forms part of The Shard Quarter development and replaced the previous 24-storey office block known as Southwark Towers. Construction on this iconic structure commenced in March 2009, and it was officially inaugurated on 5 July 2012, following its topping out on 30 March 2012.", "noref_document": "The Shard is a renowned skyscraper located in London, England. Standing at a height of 1,016 feet, it is currently the tallest building in the United Kingdom. Designed by the Italian architect Renzo Piano, The Shard has become an iconic symbol of modern architecture in London's skyline. With its distinctive glass facade, the building offers panoramic views of the city, attracting both locals and tourists alike. The Shard houses a range of facilities including offices, restaurants, a hotel, and even a public viewing gallery on its 72nd floor, providing visitors with breathtaking vistas of the capital.", "summary": "The Shard, also referred to as the Shard London Bridge and formerly London Bridge Tower, is a 72-storey skyscraper, designed by the Italian architect Renzo Piano, in Southwark, London, that forms part of The Shard Quarter development. Standing 309.6 metres (1,016 feet) high, The Shard is the tallest building in the United Kingdom, and the tallest building in Western Europe. It is also the second-tallest free-standing structure in the United Kingdom, after the concrete tower of the Emley Moor transmitting station. It replaced Southwark Towers, a 24-storey office block built on the site in 1975.\nThe Shard's construction began in March 2009; it was topped out on 30 March 2012 and inaugurated on 5 July 2012."}
{"entity_string": "https://en.wikipedia.org/wiki/One_World_Trade_Center", "entity_url": "https://en.wikipedia.org/wiki/One_World_Trade_Center", "document": "One World Trade Center, also known as One World Trade or One WTC, stands as a testament to resilience and architectural prowess. Designed by David Childs of Skidmore, Owings & Merrill, this magnificent structure is not only the tallest building in the United States, but it also holds the prestigious title of the tallest building in the Western Hemisphere. With its soaring height, it ranks as the seventh-tallest building in the entire world. This iconic skyscraper bears the same name as the ill-fated North Tower of the original World Trade Center, which tragically fell victim to the September 11, 2001 terrorist attacks. Now, rising tall on the 16-acre World Trade Center site, precisely where the original 6 World Trade Center once stood, One World Trade Center serves as a symbol of triumph and renewal for Lower Manhattan, residing within the bounds of West Street to the west, Vesey Street to the north, Fulton Street to the south, and Washington Street to the east.", "noref_document": "One World Trade Center, also known as the Freedom Tower, is a prominent architectural landmark located in Lower Manhattan, New York City. Standing at a height of 1,776 feet, it is the tallest building in the Western Hemisphere. Built as a tribute to the original World Trade Center complex that tragically fell during the 9/11 terrorist attacks, One World Trade Center serves as a symbol of resilience and renewal. The building features cutting-edge design and technology, including a sustainable and energy-efficient infrastructure. It offers breathtaking panoramic views of the city, with observation decks on the 100th, 101st, and 102nd floors. The tower is home to various commercial offices and businesses, as well as a museum dedicated to the memory of the events of September 11, 2001.", "summary": "One World Trade Center, also known as One World Trade, One WTC, and formerly called  the Freedom Tower during initial planning stages, is the main building of the rebuilt World Trade Center complex in Lower Manhattan, New York City.  Designed by David Childs of Skidmore, Owings & Merrill, One World Trade Center is the tallest building in the United States, the tallest building in the Western Hemisphere, and the seventh-tallest in the world. The supertall structure has the same name as the North Tower of the original World Trade Center, which was destroyed in the terrorist attacks of September 11, 2001. The new skyscraper stands on the northwest corner of the 16-acre (6.5 ha) World Trade Center site, on the site of the original 6 World Trade Center. It is bounded by West Street to the west, Vesey Street to the north, Fulton Street to the south, and Washington Street to the east."}
{"entity_string": "https://en.wikipedia.org/wiki/CCTV_Headquarters", "entity_url": "https://en.wikipedia.org/wiki/CCTV_Headquarters", "document": "The CCTV Headquarters, located in the Beijing Central Business District, is the impressive headquarters for China Central Television (CCTV). Designed by renowned architects Rem Koolhaas and Ole Scheeren of OMA, and with engineering design by Cecil Balmond at Arup, this 51-floor skyscraper has garnered high praise from architecture critics worldwide. Considered by some as the most significant architectural accomplishment of the century, it was even awarded the title of Best Tall Building Worldwide in 2013. Construction began in 2004, but setbacks, such as a fire in the adjacent Television Cultural Center, delayed its completion until May 2012. Despite the challenges, the building's fascinating façade was finished in January 2008, and it was officially inaugurated in June 2013.", "noref_document": "The CCTV Headquarters, also known as the Chinese Central Television Headquarters, is a unique architectural marvel located in Beijing, China. Designed by the renowned firm, OMA, and completed in 2012, this iconic building has become a symbol of modern architecture and technological innovation. Its groundbreaking design, often referred to as \"The Twisted Doughnut\" or \"The Loop,\" showcases two leaning towers connected by a striking horizontal structure. The CCTV Headquarters not only serves as the headquarters for China Central Television, but it also houses various television studios, production facilities, and offices. Its distinctive form and sleek structural design have earned it numerous accolades and have made it a popular tourist attraction in Beijing.", "summary": "The CCTV Headquarters serves as the headquarters for China Central Television (CCTV) formerly located at the old China Central Television Building some 15 km (9.3 mi) to the west. Feted by architecture critics as perhaps \"the greatest work of architecture built in this century\"  and awarded the 2013 Best Tall Building Worldwide from the Council on Tall Buildings and Urban Habitat, the 51-floor skyscraper on East Third Ring Road, Guanghua Road in the Beijing Central Business District (CBD). Groundbreaking took place on 1 June 2004 and the building's façade was completed in January 2008. After the construction was delayed by a fire that engulfed the adjacent Television Cultural Center in February 2009, the headquarters was completed in May 2012 and was officially inaugurated in June 2013.\nRem Koolhaas and Ole Scheeren of OMA were the architects in charge for the building, while Cecil Balmond at Arup provided the complex engineering design."}
{"entity_string": "https://en.wikipedia.org/wiki/Petronas_Towers", "entity_url": "https://en.wikipedia.org/wiki/Petronas_Towers", "document": "The Petronas Towers, also known as the Petronas Twin Towers and colloquially the KLCC Twin Towers, are a pair of 88-storey supertall skyscrapers in Kuala Lumpur, Malaysia. Standing at 451.9 meters (1,483 feet), these towers were officially designated as the tallest buildings in the world from 1998 to 2004. They are also the world's tallest twin skyscrapers and remain a major landmark of Kuala Lumpur. The Petronas Towers' structural system, a tube in tube design, was invented by architect Fazlur Rahman Khan.", "noref_document": "The Petronas Towers, also known as the Petronas Twin Towers, are iconic landmarks located in Kuala Lumpur, Malaysia. Standing at 451.9 meters (1,483 feet) tall, they held the title of the world's tallest buildings from 1998 to 2004. Designed by Argentine architect Cesar Pelli, the towers are connected by a double-decker Skybridge on the 41st and 42nd floors, providing breathtaking views of the city. The towers are primarily occupied by the Malaysian oil and gas company, Petronas, while also housing various offices, shopping outlets, and a concert hall. The unique architecture and impressive height of the Petronas Towers make them a major tourist attraction and a symbol of Kuala Lumpur's modern development.", "summary": "The Petronas Towers (Malay: Menara Berkembar Petronas), also known as the Petronas Twin Towers and colloquially the KLCC Twin Towers, are a pair of 88-storey supertall skyscrapers in Kuala Lumpur, Malaysia, standing at 451.9 metres (1,483 feet). From 1998 to 2004, they were officially designated as the tallest buildings in the world until they were surpassed by the completion of the Taipei 101 in 2004.  The Petronas Towers are the world's tallest twin skyscrapers and remained the tallest buildings in Malaysia until 2019, when they were surpassed by The Exchange 106. The Petronas Towers are a major landmark of Kuala Lumpur, along with the nearby Kuala Lumpur Tower and Merdeka 118, and are visible in many places across the city.\n\n\n== History and architecture ==\nThe Petronas Towers' structural system is a tube in tube design, invented by architect Fazlur Rahman Khan."}
{"entity_string": "https://en.wikipedia.org/wiki/Marina_Bay_Sands", "entity_url": "https://en.wikipedia.org/wiki/Marina_Bay_Sands", "document": "Marina Bay Sands (MBS), an integrated resort in Singapore, is a remarkable architectural feat designed by Moshe Safdie. This extravagant property, opened in 2010, boasts a 2,561-room hotel, a colossal convention-exhibition center, a high-end shopping mall called The Shoppes at Marina Bay Sands, a museum, renowned restaurants by celebrity chefs, two floating crystal pavilions, captivating art-science exhibits, and the world's largest atrium casino. The complex comprises three towers connected by a 340-meter-long SkyPark, offering breathtaking views and a 150-meter infinity swimming pool that extends over the north tower, providing a mesmerizing experience. Despite slight construction delays, primarily due to financial crises, Marina Bay Sands has become an emblem of luxury, entertainment, and architectural splendor in the heart of Singapore's Downtown Core district.", "noref_document": "Marina Bay Sands is a famous integrated resort located in Singapore. It is an architectural marvel, featuring three luxurious hotel towers, a vast convention center, a grand casino, a shopping mall, numerous dining options, and an iconic rooftop that offers breathtaking views of the city skyline. The resort is renowned for its unique design, which includes a boat-shaped SkyPark that spans across the top of the three towers, housing an observation deck, lush gardens, and an infinity pool. Marina Bay Sands has become a cultural landmark, hosting a plethora of world-class entertainment events, exhibitions, and concerts that attract visitors from all over the globe.", "summary": "The Marina Bay Sands  (abbreviation: MBS) is an integrated resort fronting Marina Bay within the Downtown Core district of Singapore. At its opening in 2010, it was billed as the world's most expensive standalone casino property at S$8 billion (US$6.88 billion), including the land cost. It is owned by the Singaporean affiliate of the Las Vegas Sands Corporation.\nDesigned by Moshe Safdie, the resort includes a 2,561-room hotel, a 120,000-square-metre (1,300,000 sq ft) convention-exhibition centre, the 74,000-square-metre (800,000 sq ft) The Shoppes at Marina Bay Sands mall, a museum, a large theatre, \"celebrity chef\" restaurants, two floating crystal pavilions, art-science exhibits, and the world's largest atrium casino with 500 tables and 1,600 slot machines. The complex includes three towers topped by a connecting 340-metre-long (1,120 ft) SkyPark with a capacity of 3,902 people and a 150 m (490 ft) infinity swimming pool, set on top of the world's largest public cantilevered platform, which overhangs the north tower by 66.5 m (218 ft).The building and its surrounds was originally set to open in 2009, but its construction faced slight delays caused by escalating costs of material and labour shortages, aggravated from the global financial crisis at the time."}
{"entity_string": "https://en.wikipedia.org/wiki/Tokyo_Skytree", "entity_url": "https://en.wikipedia.org/wiki/Tokyo_Skytree", "document": "Tokyo Skytree, a broadcasting and observation tower in Sumida, Tokyo, is an impressive architectural landmark that stands as the tallest structure in Japan. With a height of 634 meters (2,080 ft), it became the tallest tower in the world upon its completion in 2011. It is not only a significant broadcasting hub for the Kantō region but also an iconic symbol of Japan's technological prowess. Tokyo Skytree provides an alternative to the older Tokyo Tower, which faces coverage challenges due to its proximity to high-rise buildings. This majestic tower, completed on Leap Day in 2012, has since been welcoming visitors who can experience breathtaking views from its observation decks.", "noref_document": "The Tokyo Skytree is a prominent landmark and an architectural marvel located in Tokyo, Japan. Standing at a height of 634 meters (2,080 feet), it easily holds the title of the tallest tower in Japan and one of the tallest towers in the world. Designed with a distinctive futuristic aesthetic, the Tokyo Skytree acts as a broadcasting, observation, and communication tower. Its primary purpose is to provide digital television and radio broadcasting to the Kanto region, but it also serves as a popular tourist attraction. Visitors can take high-speed elevators up to the observation decks located at 350 meters (1,150 feet) and 450 meters (1,480 feet), offering breathtaking panoramic views of Tokyo and beyond. The Tokyo Skytree is not only an architectural marvel but also a symbol of the city's modernity and innovation.", "summary": "Tokyo Skytree (東京スカイツリー, Tōkyō Sukaitsurī), [toːkʲoː sɯ̥kaitsɯriː] is a broadcasting and observation tower in Sumida, Tokyo. It became the tallest structure in Japan in 2010 and reached its full height of 634 meters (2,080 ft) in March 2011, making it the tallest tower in the world, displacing the Canton Tower, and the third tallest structure in the world after the Merdeka 118 (678.9 m or 2,227 ft) and the Burj Khalifa (829.8 m or 2,722 ft). It is also the tallest freestanding structure in the OECD, the G20 and G7 countries.\nThe tower is the primary television and radio broadcast site for the Kantō region; the older Tokyo Tower no longer gives complete digital terrestrial television broadcasting coverage because it is surrounded by high-rise buildings. Skytree was completed on Leap Day, 29 February 2012, with the tower opening to the public on 22 May 2012."}
{"entity_string": "https://en.wikipedia.org/wiki/Metropol_Parasol", "entity_url": "https://en.wikipedia.org/wiki/Metropol_Parasol", "document": "Metropol Parasol, also known as Setas de Sevilla or The Mushrooms, is an impressive wooden structure located in the old quarter of Seville, Spain. Designed by German architect Jürgen Mayer, it was completed in April 2011 and is approximately 150 by 70 meters in size with a height of 26 meters. The structure features six parasols that resemble large mushrooms and is constructed using 3,500 cubic meters of micro-laminated Finnish pine. It houses a traditional market, restaurants, an archaeological museum, a performance square, and a rooftop terrace offering panoramic views of Seville's old city. Despite initial technical and budgetary challenges, Metropol Parasol has become the city's third most-visited urban landmark since its opening.", "noref_document": "Metropol Parasol, also known as Las Setas (The Mushrooms), is an iconic structure located in the heart of Seville, Spain. Designed by architect Jürgen Mayer, this unique wooden structure stands as the largest wooden structure in the world. Spanning over four levels, Metropol Parasol boasts a stunning architectural design that transforms the traditional perception of a plaza. The structure's undulating shape offers shade from the scorching Spanish sun, while its uppermost level provides breathtaking panoramic views of Seville's cityscape. Additionally, the lower levels of the structure host a vibrant market, housing numerous bars, cafes, and shops, creating a bustling atmosphere for locals and tourists alike. Metropol Parasol's emergence has brought a modern twist to the historic city of Seville, becoming a symbol of contemporary architecture and a must-visit landmark for visitors.", "summary": "Setas de Sevilla (\"Mushrooms of Seville\") or Las Setas (\"The Mushrooms\"), initially titled Metropol Parasol, is a large, predominantly wood structure located at La Encarnación square in the old quarter of Seville, Spain. It accommodates a traditional market, restaurants, a performance square, archaeological museum — and 'rooftop' terrace with a panoramic view of Seville's old city.\nSelected from 65 submissions in a city-sponsored competition, the structure was designed by German architect Jürgen Mayer, was completed in April 2011, and is roughly 150 by 70 metres (490 by 230 ft) with an approximate height of 26 metres (85 ft).Initially beset with technical problems as well as budget and schedule overruns, the parasols are constructed of 3,500 cubic meters of micro-laminated Finnish pine and are marketed as the world's largest wood structure.Since their opening, the parasols have become Seville's third-most visited urban landmark.\n\n\n== The name ==\nDuring development, the project was titled Metropol Parasol, with locals quickly adopting a colloquial nickname, the setas or mushrooms. Seville officially adopted the name Setas de Sevilla after discovering the project's architect had trademarked the name \"Metropol Parasol\" and would charge for its use; Setas de Sevilla has been the project's official name since opening,\n\n\n== Design ==\nThe structure consists of six parasols loosely resembling large mushrooms, inspired by the vaults of the Cathedral of Seville and the ficus trees in the nearby Plaza de Cristo de Burgos."}
{"entity_string": "https://en.wikipedia.org/wiki/The_Broad", "entity_url": "https://en.wikipedia.org/wiki/The_Broad", "document": "The Broad, a contemporary art museum located on Grand Avenue in Downtown Los Angeles, stands as a testament to the passion for art and philanthropy of its namesake, Eli and Edythe Broad. The museum showcases an impressive art collection housed within a remarkable $140 million building that was financed by the couple. Visitors can enjoy free general admission to explore the permanent collection galleries, providing an accessible way to immerse themselves in the world of contemporary art. While the museum offers various events and exhibits, it's worth noting that not all of these are free, and admission prices may vary. Since its opening on September 20, 2015, The Broad has become an artistic haven in the heart of Los Angeles.", "noref_document": "The Broad is a contemporary art museum located in downtown Los Angeles, California. Founded by philanthropists Eli and Edythe Broad, the museum opened its doors to the public in 2015 and houses a vast collection of contemporary art, including works by renowned artists such as Andy Warhol, Jeff Koons, and Cindy Sherman. The building itself is an architectural marvel designed by Diller Scofidio + Renfro, featuring a unique honeycomb-like exterior that filters natural light into the galleries. With its impressive collection and striking design, The Broad has become a must-visit destination for art enthusiasts from around the world.", "summary": "The Broad () is a contemporary art museum on Grand Avenue in Downtown Los Angeles. The museum is named for philanthropists Eli and Edythe Broad, who financed the $140 million building that houses the Broad art collections. It offers free general admission to its permanent collection galleries. However, not all of its events are free and admission prices may vary by exhibit and/or by event. It opened on September 20, 2015."}
{"entity_string": "https://en.wikipedia.org/wiki/Harpa_(concert_hall)", "entity_url": "https://en.wikipedia.org/wiki/Harpa_(concert_hall)", "document": "Harpa, a stunning concert hall and conference center located in Reykjavik, Iceland, is a true architectural marvel. Designed by the renowned Danish firm, Henning Larsen Architects, in collaboration with the talented Danish-Icelandic artist, Olafur Eliasson, the building's exterior is adorned with a captivating colored glass facade. This unique feature draws inspiration from Iceland's breathtaking basalt landscape. Combining a steel framework with an array of geometric shaped glass panels in various vibrant colors, Harpa stands as a modern masterpiece that beautifully captures the imagination of all who encounter it.", "noref_document": "Harpa is a concert hall and conference center located in Reykjavík, Iceland. Designed by Olafur Eliasson and Henning Larsen Architects, it is a mesmerizing architectural marvel that has become an iconic landmark in the city. Harpa offers a unique blend of modern design and natural elements inspired by Iceland's rugged landscape. With its distinctive glass facade resembling a honeycomb, Harpa is not only visually stunning but also acoustically exceptional. Housing the Iceland Symphony Orchestra and the Icelandic Opera, it serves as a hub for world-class performances and cultural events. The concert hall's interior features multiple performance spaces, including a grand concert hall, a smaller recital hall, and a flexible theater. Harpa also houses exhibition spaces, shops, restaurants, and hosts a variety of conferences, making it a multi-functional and vibrant cultural center.", "summary": "Harpa (Icelandic pronunciation: [ˈhar̥pa], English: Harp) is a concert hall and conference centre in Reykjavík, Iceland. The opening concert was held on May 4, 2011. The building features a distinctive colored glass facade inspired by the basalt landscape of Iceland.\n\n\n== History ==\nHarpa was designed by the Danish firm Henning Larsen Architects in co-operation with Danish-Icelandic artist Olafur Eliasson. The structure consists of a steel framework clad with geometric shaped glass panels of different colours."}
{"entity_string": "https://en.wikipedia.org/wiki/Breaking_Bad", "entity_url": "https://en.wikipedia.org/wiki/Breaking_Bad", "document": "Breaking Bad, the critically acclaimed American crime drama television series created by Vince Gilligan for AMC, takes viewers on a thrilling and suspenseful journey. Set and filmed in Albuquerque, New Mexico, the show revolves around the life of Walter White, a high-school chemistry teacher faced with a devastating diagnosis of stage-three lung cancer. Struggling with financial difficulties and a desire to provide for his family's future, Walter delves into a dangerous world of crime. Teaming up with his former student, Jesse Pinkman, they embark on a risky venture of producing and distributing methamphetamine. As the series unfolds, the audience is taken on a rollercoaster ride of intense character development, navigating the treacherous criminal underworld. Breaking Bad premiered in 2008 and captivated audiences for five seasons, with an ensemble cast including Bryan Cranston as Walter White, Aaron Paul as Jesse Pinkman, and a host of other talented actors portraying integral characters such as family members, lawyers, investigators, and drug kingpins.", "noref_document": "Breaking Bad is a critically acclaimed American television series created by Vince Gilligan. The show follows the story of Walter White, a high school chemistry teacher turned methamphetamine manufacturer, and his former student, Jesse Pinkman, as they navigate the dangerous underworld of illegal drug production in Albuquerque, New Mexico. Known for its compelling storytelling, complex characters, and dark humor, Breaking Bad explores themes of morality, greed, and the consequences of one's actions. The series garnered widespread praise for its writing, acting, and visual style, establishing itself as one of the greatest television dramas of all time.", "summary": "Breaking Bad is  an American crime drama television series created and produced by Vince Gilligan for AMC. Set and filmed in Albuquerque, New Mexico, the series follows Walter White (Bryan Cranston), an underpaid, overqualified, and dispirited high-school chemistry teacher who is struggling with a recent diagnosis of stage-three lung cancer. White turns to a life of crime and partners with a former student, Jesse Pinkman (Aaron Paul), to produce and distribute methamphetamine to secure his family's financial future before he dies, while navigating the dangers of the criminal underworld. Breaking Bad premiered on AMC on January 20, 2008, and concluded on September 29, 2013, after five seasons consisting of 62 episodes.\nAmong the show's co-stars are Anna Gunn and RJ Mitte as Walter's wife Skyler and son Walter Jr., and Betsy Brandt and Dean Norris as Skyler's sister Marie Schrader and her husband Hank, a DEA agent. Others include Bob Odenkirk as Walter's and Jesse's lawyer Saul Goodman, Jonathan Banks as private investigator and fixer Mike Ehrmantraut, and Giancarlo Esposito as drug kingpin Gus Fring."}
{"entity_string": "https://en.wikipedia.org/wiki/The_Office_(U.S._TV_series)", "entity_url": "https://en.wikipedia.org/wiki/The_Office_(U.S._TV_series)", "document": "The Office is an iconic American mockumentary sitcom that takes viewers into the amusing and sometimes cringeworthy world of office life. Set at the Scranton branch of the fictional Dunder Mifflin Paper Company in Pennsylvania, the show offers a hilarious and relatable glimpse into the everyday work lives of a diverse group of employees. Airing from 2005 to 2013, The Office spanned a total of nine seasons and quickly became a beloved television series. Created by Ricky Gervais and Stephen Merchant, the show's adaptation for American audiences was masterfully done by Greg Daniels, a seasoned writer known for his work on popular shows like Saturday Night Live, King of the Hill, and The Simpsons. Co-produced by Daniels' Deedle-Dee Productions and Reveille Productions, in association with Universal Television, The Office featured an all-star cast and successfully blended humor with insightful commentary on office politics and relationships. It quickly gained a devoted fanbase and solidified its place as a modern classic in the sitcom genre.", "noref_document": "The Office is a widely popular American television series that was adapted from the original British version. Premiering in 2005, the show is a mockumentary-style sitcom that revolves around the daily lives of office employees working at Dunder Mifflin Paper Company. Set in Scranton, Pennsylvania, the series humorously explores the dynamics of a quirky and diverse group of employees through their interactions, pranks, and the underlying tensions amongst them. With a talented ensemble cast led by Steve Carell as Michael Scott, the bumbling yet well-meaning regional manager, The Office captivated audiences with its relatable characters, sharp writing, and distinctive documentary-style format. The series continues to enjoy a dedicated fanbase even after its conclusion in 2013, thanks to its endearing characters and binge-worthy storytelling.", "summary": "The Office is an American mockumentary sitcom television series that depicts the everyday work lives of office employees at the Scranton, Pennsylvania, branch of the fictional Dunder Mifflin Paper Company. It aired on NBC from March 24, 2005, to May 16, 2013, spanning a total of nine seasons. Based on the 2001–2003 BBC series of the same name created by Ricky Gervais and Stephen Merchant, it was adapted for American television by Greg Daniels, a veteran writer for Saturday Night Live, King of the Hill, and The Simpsons. It was co-produced by Daniels' Deedle-Dee Productions and Reveille Productions (later Shine America), in association with Universal Television. The original executive producers were Daniels, Gervais, Merchant, Howard Klein, and Ben Silverman, with numerous others being promoted in later seasons."}
{"entity_string": "https://en.wikipedia.org/wiki/Friends", "entity_url": "https://en.wikipedia.org/wiki/Friends", "document": "Friends, created by David Crane and Marta Kauffman, is an iconic American television sitcom that aired on NBC from September 22, 1994, to May 6, 2004. Lasting for ten memorable seasons, the show follows the lives of six friends in their 20s and 30s who reside in Manhattan, New York City. With an ensemble cast featuring Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc, Matthew Perry, and David Schwimmer, Friends became a global phenomenon, captivating audiences with its relatable characters, witty humor, and heartfelt moments. Originally developed under the working title Insomnia Cafe, the show underwent various script rewrites and title changes before the series was eventually named Friends. The original executive producers, Kevin S. Bright, Kauffman, and Crane, played instrumental roles in shaping the beloved sitcom.", "noref_document": "\"F.R.I.E.N.D.S\" is a popular American sitcom that aired from 1994 to 2004. Created by David Crane and Marta Kauffman, the show revolves around a group of six friends living in Manhattan, New York. It features a blend of comedy, romance, and drama as it explores the ups and downs of their personal and professional lives. The central characters, Monica, Ross, Rachel, Chandler, Joey, and Phoebe, face relatable situations, navigating through careers, relationships, and the challenges of adulthood. With its iconic catchphrases, memorable quirks, and well-developed characters, \"F.R.I.E.N.D.S\" has become a cultural phenomenon and continues to captivate audiences worldwide.", "summary": "Friends is an American television sitcom created by David Crane and Marta Kauffman, which aired on NBC from September 22, 1994, to May 6, 2004, lasting ten seasons. With an ensemble cast starring Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc, Matthew Perry and David Schwimmer, the show revolves around six friends in their 20s and 30s who live in Manhattan, New York City. The original executive producers were Kevin S. Bright, Kauffman, and Crane.\nKauffman and Crane began developing Friends under the working title Insomnia Cafe between November and December 1993. They presented the idea to Bright, and together they pitched a seven-page treatment of the show to NBC. After several script rewrites and changes, including title changes to Six of One and Friends Like Us, the series was finally named Friends."}
{"entity_string": "https://en.wikipedia.org/wiki/How_I_Met_Your_Mother", "entity_url": "https://en.wikipedia.org/wiki/How_I_Met_Your_Mother", "document": "How I Met Your Mother (often abbreviated as HIMYM) is an American sitcom that aired from September 19, 2005 to March 31, 2014. Created by Craig Thomas and Carter Bays for CBS, the series revolves around the life of the main character, Ted Mosby, and his group of friends in Manhattan, New York City. A unique aspect of the show is its framing device, with Ted recounting the events that led him to meet his children's mother, starting from September 2005 and spanning until May 2013. How I Met Your Mother was a joint production by Bays & Thomas Productions and 20th Century Fox Television, and it was syndicated by 20th Television (now Disney-ABC Domestic Television). The series drew inspiration from Thomas and Bays' own friendship during their time in New York, and Pamela Fryman directed the vast majority of its episodes, directing 196 out of 208.", "noref_document": "\"How I Met Your Mother\" is a popular American sitcom that aired from 2005 to 2014. Set in New York City, the show follows a group of friends and their romantic escapades, primarily through the eyes of the protagonist, Ted Mosby. The series gained a large fan base due to its witty humor, compelling narrative structure, and the iconic catchphrases it introduced, such as \"legen... wait for it... dary.\" \"How I Met Your Mother\" also incorporated storytelling techniques, often using flashbacks and flash-forwards, as Ted recounts the story of how he met his children's mother. With its clever writing, relatable characters, and memorable moments, the show remains a beloved part of modern television culture.", "summary": "How I Met Your Mother (often abbreviated as HIMYM) is an American sitcom, created by Craig Thomas and Carter Bays for CBS. The series, which aired from September 19, 2005 to March 31, 2014, follows the main character, Ted Mosby, and his group of friends in New York City's Manhattan. As a framing device, Ted, in 2030, recounts to his son, Luke, and daughter, Penny, the events from September 2005 to May 2013 that led him to meet their mother. How I Met Your Mother was a joint production by Bays & Thomas Productions and 20th Century Fox Television, and syndicated by 20th Television (now Disney-ABC Domestic Television).\nThe series was loosely inspired by Thomas and Bays' friendship when they both lived in New York. The vast majority of the episodes (196 out of 208) were directed by Pamela Fryman."}
{"entity_string": "https://en.wikipedia.org/wiki/Parks_and_Recreation", "entity_url": "https://en.wikipedia.org/wiki/Parks_and_Recreation", "document": "Parks and Recreation, a beloved American political satire sitcom created by Greg Daniels and Michael Schur, aired from 2009 to 2015, captivating audiences with its witty humor and unique mockumentary style. The show revolves around Leslie Knope, played by Amy Poehler, an optimistic and determined bureaucrat working in the Parks Department of Pawnee, Indiana. With a talented ensemble cast including Rashida Jones, Aziz Ansari, Nick Offerman, Aubrey Plaza, Chris Pratt, and many more, the series skillfully combines comedy and satire to explore the inner workings of local government and the quirky dynamics of small-town life. Although the show concluded in 2015, a special reunion episode in 2020 brought back the beloved characters, reminding fans of the delightful charm that Parks and Recreation has become known for.", "noref_document": "Parks and Recreation is an American political satire television sitcom that aired from 2009 to 2015. Created by Greg Daniels and Michael Schur, the show explores the daily operations of the Parks Department in the fictional town of Pawnee, Indiana. Led by the enthusiastic and eager-to-please Leslie Knope, the department faces various challenges while striving to improve the city's parks and recreational activities. With its witty humor, endearing characters, and clever storytelling, Parks and Recreation has garnered a strong fan base and critical acclaim, becoming a beloved and influential TV series.", "summary": "Parks and Recreation (also known as Parks and Rec) is an American political satire mockumentary sitcom television series created by Greg Daniels and Michael Schur. The series aired on NBC from April 9, 2009, to February 24, 2015, for 125 episodes, over seven seasons. A special reunion episode aired on April 30, 2020. The series stars Amy Poehler as Leslie Knope, a perky, mid-level bureaucrat in the Parks Department of the fictional town of Pawnee, Indiana. The ensemble and supporting cast features Rashida Jones as Ann Perkins, Paul Schneider as Mark Brendanawicz, Aziz Ansari as Tom Haverford, Nick Offerman as Ron Swanson, Aubrey Plaza as April Ludgate, Chris Pratt as Andy Dwyer, Adam Scott as Ben Wyatt, Rob Lowe as Chris Traeger, Jim O'Heir as Garry \"Jerry\" Gergich, Retta as Donna Meagle, and Billy Eichner as Craig Middlebrooks."}
{"entity_string": "https://en.wikipedia.org/wiki/30_Rock", "entity_url": "https://en.wikipedia.org/wiki/30_Rock", "document": "30 Rock, the American satirical sitcom television series created by Tina Fey, aired on NBC from October 11, 2006, to January 31, 2013. Drawing from Fey's experiences as head writer for Saturday Night Live, the show takes viewers behind the scenes of a fictional live sketch comedy show, set to air on NBC. The series is named after 30 Rockefeller Plaza in New York City, where NBC Studios and Saturday Night Live are based. Produced by Lorne Michaels's Broadway Video and Fey's Little Stranger, in association with NBCUniversal, 30 Rock episodes were shot in a single-camera setup, except for two live episodes. The series boasts a stellar cast including Alec Baldwin, Tracy Morgan, Jane Krakowski, Jack McBrayer, and more. Notably, 30 Rock employs surreal humor to satirize the intricate corporate structure of NBC, General Electric, and Comcast, its parent companies.", "noref_document": "30 Rock is a landmark television series that aired from 2006 to 2013. Created by the talented comedic mind of Tina Fey, the show takes its name from the iconic address of the NBC Studios located in New York City. Known for its sharp writing and brilliant ensemble cast, 30 Rock delves into the chaotic world of producing a live sketch comedy show, fictionalizing the ups and downs of working behind the scenes at a television network. Fey's character, Liz Lemon, serves as the head writer for the show within the show, offering a humorous and relatable glimpse into the challenges and absurdities of the entertainment industry. With its clever wit, memorable characters, and satirical commentary, 30 Rock has solidified its place as one of the greatest sitcoms of all time.", "summary": "30 Rock is an American satirical sitcom television series created by Tina Fey that originally aired on NBC from October 11, 2006, to January 31, 2013. The series, based on Fey's experiences as head writer for Saturday Night Live, takes place behind the scenes of a fictional live sketch comedy show depicted as airing on NBC. The series's name refers to 30 Rockefeller Plaza in New York City, where the NBC Studios are located and where Saturday Night Live is written, produced, and performed. The series was produced by Lorne Michaels's Broadway Video (which also produces Saturday Night Live) and Fey's Little Stranger, in association with NBCUniversal.30 Rock episodes were produced in a single-camera setup (with the exception of the two live episodes that were produced in the multiple-camera setup) and were filmed in New York. The pilot episode premiered on October 11, 2006, and seven seasons followed. The series stars Fey with a supporting cast that includes Alec Baldwin, Tracy Morgan, Jane Krakowski, Jack McBrayer, Scott Adsit, Judah Friedlander, Katrina Bowden, Keith Powell, Lonny Ross, John Lutz, Kevin Brown, Grizz Chapman, and Maulik Pancholy.Tonally, 30 Rock uses surreal humor to parody the complex corporate structure of NBC and its parent companies General Electric and Comcast."}
{"entity_string": "https://en.wikipedia.org/wiki/Mad_Men", "entity_url": "https://en.wikipedia.org/wiki/Mad_Men", "document": "Mad Men is an intriguing American period drama television series that aired from 2007 to 2015. Created by Matthew Weiner and produced by Lionsgate Television, the show takes place from 1960 to 1970 and revolves around the advertising industry. Starting at the fictional Sterling Cooper agency in Manhattan's Madison Avenue, the storyline later shifts to the new firm of Sterling Cooper Draper Pryce. The phrase \"Mad men\" was reportedly coined by advertisers on Madison Avenue in the 1950s to refer to themselves. The series follows the charismatic advertising executive Don Draper, played by Jon Hamm, and his journey as the talented creative director at Sterling Cooper.", "noref_document": "Mad Men is an American television drama series that depicts the advertising industry during the 1960s and focuses on the lives of the men and women working at the fictional Sterling Cooper advertising agency on Madison Avenue in New York City. The show explores the inner workings of the advertising world, highlighting its competitive nature, workplace dynamics, and the personal struggles of the characters. Set against the backdrop of the changing social and cultural landscape of the era, Mad Men immerses viewers in the glamorous yet tumultuous world of Madison Avenue advertising.", "summary": "Mad Men  is an American period drama television series created by Matthew Weiner and produced by Lionsgate Television. It ran on the cable network AMC from July 19, 2007, to May 17, 2015, lasting for seven seasons and 92 episodes. The show is set from March 1960 to November 1970.\nMad Men begins at the fictional Sterling Cooper advertising agency on Madison Avenue in Manhattan, New York City, and continues at the new firm of Sterling Cooper Draper Pryce (later named Sterling Cooper & Partners) near the Time-Life Building at 1271 Sixth Avenue. According to the pilot episode, the phrase \"Mad men\" was a slang term coined in the 1950s by advertisers working on Madison Avenue to refer to themselves, \"Mad\" being short for \"Madison\" (in reality, the only documented use of the phrase from that time may have been in the late-1950s writings of James Kelly, an advertising executive and writer).The series's main character is the charismatic advertising executive Don Draper (played by Jon Hamm), who is initially the talented creative director at Sterling Cooper."}
{"entity_string": "https://en.wikipedia.org/wiki/Dexter_(TV_series)", "entity_url": "https://en.wikipedia.org/wiki/Dexter_(TV_series)", "document": "Dexter, the critically acclaimed American crime drama television series, captivated audiences from 2006 to 2013. Set in the vibrant city of Miami, the show revolves around the complex life of Dexter Morgan, a forensic technician specializing in bloodstain pattern analysis for the fictional Miami Metro Police Department. But beneath his seemingly ordinary job, Dexter hides a dark secret - he is a vigilante serial killer. Fueled by a desire to bring justice to those who have escaped punishment, he hunts down murderers who have evaded the grasp of the flawed justice system. The series, adapted from Jeff Lindsay's novel Darkly Dreaming Dexter, introduces viewers to a thrilling narrative that often diverges from the original source material, captivating fans with its twist-filled storylines and the riveting performance of Michael C. Hall in the lead role.", "noref_document": "\"Dexter\" is an acclaimed television series that aired from 2006 to 2021. It revolves around the fascinating character of Dexter Morgan, a blood-spatter analyst by day and a methodical serial killer by night. Set in Miami, the show presents a gripping storyline filled with suspense, crime, and moral ambiguity. Dexter's ability to blend seamlessly into society while satisfying his dark desires adds a unique twist to the traditional crime drama genre. With its complex characters, intricate plotlines, and exploration of themes such as vigilantism and the nature of evil, \"Dexter\" has garnered a dedicated fanbase and remains a prominent piece in the history of television.", "summary": "Dexter is an American crime drama television series that aired on Showtime from October 1, 2006, to September 22, 2013. Set in Miami, the series centers on Dexter Morgan (Michael C. Hall), a forensic technician specializing in bloodstain pattern analysis for the fictional Miami Metro Police Department, who leads a secret parallel life as a vigilante serial killer, hunting down murderers who have not been adequately punished by the justice system due to corruption or legal technicalities. The show's first season was derived from the novel Darkly Dreaming Dexter (2004), the first in a series of novels by Jeff Lindsay. It was adapted for television by James Manos Jr., who wrote the first episode. Subsequent seasons evolved independently of Lindsay's works."}
{"entity_string": "https://en.wikipedia.org/wiki/BlackBerry_OS", "entity_url": "https://en.wikipedia.org/wiki/BlackBerry_OS", "document": "BlackBerry OS, developed by BlackBerry Limited, was a proprietary mobile operating system for BlackBerry smartphones. It provided multitasking, specialized input devices, and support for corporate email through Java Micro Edition MIDP. With wireless activation and synchronization, users could seamlessly connect with Microsoft Exchange, Lotus Domino, or Novell GroupWise email, calendar, tasks, notes, and contacts using the BlackBerry Enterprise Server. The platform also supported WAP 2.0. Wireless carriers offered over-the-air software updates for BlackBerry OS.", "noref_document": "BlackBerry OS is a mobile operating system developed by BlackBerry Limited for its line of smartphones. Initially launched in 1999, BlackBerry OS became known for its strong focus on secure communication and its iconic physical keyboards. It offered users a range of features such as push email, messaging, and internet browsing. Over the years, BlackBerry OS evolved to include additional functionalities like social media integration and app support. However, with the rise of iOS and Android, BlackBerry OS faced tough competition and struggled to maintain its market share. Eventually, the company decided to discontinue the operating system in favor of adopting Android for its newer devices.", "summary": "BlackBerry OS is a discontinued proprietary mobile operating system developed by Canadian company BlackBerry Limited for its BlackBerry line of smartphone handheld devices. The operating system provides multitasking and supports specialized input devices adopted by BlackBerry for use in its handhelds, particularly the trackwheel, trackball, and most recently, the trackpad and touchscreen.\nThe BlackBerry platform natively supports corporate email, through Java Micro Edition MIDP 1.0 and, more recently, a subset of MIDP 2.0, which allows complete wireless activation and synchronization with Microsoft Exchange, Lotus Domino, or Novell GroupWise email, calendar, tasks, notes and contacts, when used with BlackBerry Enterprise Server.  The operating system also supports WAP 2.0.\nUpdates to the operating system were automatically available from wireless carriers that supported the BlackBerry over the air software loading (OTASL) service."}
{"entity_string": "https://en.wikipedia.org/wiki/Windows_Phone", "entity_url": "https://en.wikipedia.org/wiki/Windows_Phone", "document": "Windows Phone, developed by Microsoft, was a family of mobile operating systems aimed at the consumer market. With its launch in October 2010, it introduced a new user interface inspired by the Metro design language. Unlike its predecessor, Windows Mobile, Windows Phone targeted consumers instead of enterprises. In 2012, Windows Phone 8 was released, which replaced the Windows CE-based kernel with the Windows NT kernel, similar to the one used in PC versions of Windows. Despite the improvements, this upgrade rendered Windows Phone 7 devices incompatible with the new OS. Nonetheless, it still supported apps originally developed for Windows Phone 7.", "noref_document": "Windows Phone was a mobile operating system developed by Microsoft. It was launched in October 2010 as the successor to Windows Mobile, and aimed to provide a unique and user-friendly experience for smartphones. Windows Phone featured a distinctive tile-based interface known as the \"Metro\" design language, which focused on simplicity and visual appeal. The operating system offered a wide range of features such as live tiles, seamless integration with Microsoft services, and a fluid and responsive user interface. Despite its innovative design and capabilities, Windows Phone faced tough competition from Android and iOS, and struggled to gain significant market share. Microsoft eventually announced the discontinuation of Windows Phone in 2017, shifting their focus towards other platforms.", "summary": "Windows Phone (WP) is a discontinued family of mobile operating systems developed by Microsoft for smartphones as the replacement successor to Windows Mobile and Zune. Windows Phone featured a new user interface derived from the Metro design language. Unlike Windows Mobile, it was primarily aimed at the consumer market rather than the enterprise market.It was first launched in October 2010 with Windows Phone 7. Windows Phone 8 succeeded it in 2012, replacing the Windows CE-based kernel of Windows Phone 7 with the Windows NT kernel used by the PC versions of Windows (and, in particular, a large amount of internal components from Windows 8). Due to these changes, the OS was incompatible with all existing Windows Phone 7 devices, although it still supported apps originally developed for Windows Phone 7."}
{"entity_string": "https://en.wikipedia.org/wiki/Google_Reader", "entity_url": "https://en.wikipedia.org/wiki/Google_Reader", "document": "Google Reader, an RSS/Atom feed aggregator, was a beloved platform that offered users a centralized hub to access and read their favorite publications and websites. Developed by Google engineer Chris Wetherell, it was launched in 2005 and quickly gained popularity, becoming a key tool for many who relied on it for their daily news consumption. Moreover, Google Reader served as a foundation for various programs that utilized it to deliver timely and relevant information to users. However, with declining usage, Google made the difficult decision to shut down Google Reader in 2013, leaving behind nostalgic memories and a void in the RSS reader market.", "noref_document": "Google Reader was a web-based aggregator launched by Google in October 2005 that allowed users to subscribe to and read RSS and Atom feeds. It became popular among users who wanted to easily keep track of updates from their favorite websites and blogs in one central location. With Google Reader, individuals were able to organize their subscriptions into folders, tag articles for future reference, and even share interesting content with their friends. However, despite its initial success, Google decided to shut down Google Reader in July 2013, much to the disappointment of its dedicated user base.", "summary": "Google Reader was an RSS/Atom feed aggregator operated by Google. It was created in early 2005 by Google engineer Chris Wetherell and launched on October 7, 2005, through Google Labs. Google Reader grew in popularity to support a number of programs which used it as a platform for serving news and information to users. Google closed Google Reader on July 1, 2013, citing declining use.\n\n\n== History ==\nIn early 2001, software engineer Chris Wetherell began a project he called \"JavaCollect\" that served as a news portal based on web feeds."}
{"entity_string": "https://en.wikipedia.org/wiki/Microsoft_Groove", "entity_url": "https://en.wikipedia.org/wiki/Microsoft_Groove", "document": "Microsoft Groove, previously known as Xbox Music and Zune Music Pass, was a popular audio player software that came bundled with Windows operating systems. Alongside the software, Microsoft also offered a music streaming service called Groove Music Pass, accessible on various platforms including Windows, Xbox consoles, Windows Phone, Android, and iOS. Boasting an extensive catalogue of more than 50 million tracks, Groove Music offered users a vast selection of music to enjoy. However, Groove Music Pass was officially discontinued on December 31, 2017, with the Android and iOS versions of the Groove Music app following suit in December 2018, limiting the player to its native Microsoft Store. With the release of Windows 10 and subsequently Windows 11, Groove Music was succeeded by the Media Player, which was gradually rolled out to Windows 10 users between January and June 2023.", "noref_document": "Microsoft Groove, previously known as Xbox Music and Zune Music, is a digital music streaming service developed by Microsoft. It provides users with access to a vast collection of songs from various genres and artists, allowing them to stream music online or download it for offline listening. With a user-friendly interface and intuitive features, Microsoft Groove offers playlist creation, personalized recommendations, and the ability to sync music across multiple devices. Additionally, the service integrates seamlessly with Microsoft's other platforms and devices, such as Windows, Xbox, and Windows Phone, ensuring a unified music experience for its users.", "summary": "Groove Music (formerly Xbox Music or Zune Music Pass) is a discontinued audio player software application included with Windows 8, Windows 8.1, Windows 10 and Windows 11.\nThe app is also associated with a now-discontinued music streaming service, Groove Music Pass, which was supported across Windows, Xbox video game consoles, Windows Phone, as well as Android and iOS. As of 2014, The Groove catalogue had over 50 million tracks. Its subscription service Groove Music Pass was officially discontinued on December 31, 2017, and the Android and iOS versions of the Groove Music app were discontinued in December 2018, restricting the player to its native Microsoft Store base.\nGroove Music was superseded by Media Player in Windows 10 and Windows 11. The update was rolled out to Windows 10 users between January and June 2023."}
{"entity_string": "https://en.wikipedia.org/wiki/IPhoto", "entity_url": "https://en.wikipedia.org/wiki/IPhoto", "document": "iPhoto, a digital photograph manipulation software application developed by Apple Inc, became a prominent tool for Mac users from 2002 to 2015. It offered a range of features including importing, organizing, editing, printing, and sharing digital photos. Announced at Macworld 2002 alongside significant updates and announcements for Apple products, iPhoto soon became a part of the iLife suite of digital media management applications. In 2012, Apple introduced an iOS-native version of iPhoto, aligning it with the growing popularity of mobile devices. However, in 2014, Apple decided to discontinue iPhoto and focus on developing their new Photos app. This transition was completed in 2015 with the release of OS X Yosemite 10.10.3, which included the new Photos app.", "noref_document": "iPhoto is a digital photograph manipulation software application developed by Apple Inc. It was first released in 2002 as part of the iLife suite of digital media management applications. iPhoto allowed users to import, organize, edit, print, and share their photos in a seamless and user-friendly way. It featured a range of powerful tools, including basic editing functionality, filters, and effects, making it a popular choice among Mac users for managing their photo libraries. iPhoto was later replaced by the new Photos app in 2015, which offered even more advanced features and integration with cloud storage services.", "summary": "iPhoto is a discontinued digital photograph manipulation software application developed by Apple Inc. It was included with every Mac computer from 2002 to 2015, when it was replaced with Apple's Photos application. Originally sold as part of the iLife suite of digital media management applications, iPhoto is able to import, organize, edit, print and share digital photos.\n\n\n== History ==\niPhoto was announced at Macworld 2002, during which Steve Jobs (then-CEO of Apple) also announced that macOS would be the default operating system on new Macs, and revealed new iMac and iBook models.On March 7, 2012, Apple CEO Tim Cook announced an iOS-native version of iPhoto alongside the third-generation iPad.On June 27, 2014, Apple announced that they would cease development of iPhoto and work on a transition to their new Photos app. On February 5, 2015 Apple included a preview of Photos with a beta release of OS X Yosemite.On April 8, 2015, Apple released OS X Yosemite 10.10.3, which included the new Photos app."}
{"entity_string": "https://en.wikipedia.org/wiki/Internet_Explorer", "entity_url": "https://en.wikipedia.org/wiki/Internet_Explorer", "document": "Internet Explorer, formerly known as Microsoft Internet Explorer, is a series of graphical web browsers developed by Microsoft. Once a popular choice for Windows operating systems, Internet Explorer has now been discontinued for most modern Windows editions. However, it continues to be supported on certain editions such as Windows 10 LTSB/LTSC. Initially released in 1995 as part of the Plus! for Windows 95 add-on package, later versions were made available as free downloads or in-service packs and included in OEM service releases of Windows. At its peak, Microsoft invested over US$100 million per year on Internet Explorer, involving more than 1,000 individuals in the project by 1999.", "noref_document": "Internet Explorer is a web browser developed by Microsoft. It was first released in 1995 and quickly became one of the most popular browsers in the world. Internet Explorer played a significant role in the early days of the Internet, providing users with a simple and intuitive interface to navigate the web. Despite its initial success, Internet Explorer faced criticism for its slow performance and lack of compatibility with modern web standards. As a result, Microsoft discontinued Internet Explorer in 2015 and replaced it with Microsoft Edge. However, Internet Explorer's impact on shaping the internet and its role in introducing many users to the online world cannot be underestimated.", "summary": "Internet Explorer (formerly Microsoft Internet Explorer and Windows Internet Explorer, commonly abbreviated as IE or MSIE) is  a deprecated (or discontinued for most modern Windows editions) series of graphical web browsers developed by Microsoft that were used in the Windows line of operating systems. While IE has been discontinued on most Windows editions, it remains supported on certain editions of Windows, such as Windows 10 LTSB/LTSC. Starting in 1995, it was first released as part of the add-on package Plus! for Windows 95 that year. Later versions were available as free downloads or in-service packs and included in the original equipment manufacturer (OEM) service releases of Windows 95 and later versions of Windows. Microsoft spent over US$100 million per year on Internet Explorer in the late 1990s, with over 1,000 people involved in the project by 1999."}
{"entity_string": "https://en.wikipedia.org/wiki/ITunes", "entity_url": "https://en.wikipedia.org/wiki/ITunes", "document": "iTunes revolutionized the way we consume and organize digital media. Originally announced by Apple CEO Steve Jobs in 2001, this software program has become a powerhouse in the world of media players. While its main focus was initially music, iTunes has evolved to include a wide range of features. It serves as a media library, allowing users to purchase, play, download, and organize digital multimedia. Not only can it be used on macOS and Windows operating systems, but it also serves as a mobile device management utility. With iTunes, users can rip songs from CDs and create dynamic, smart playlists. Furthermore, it offers options for sound optimizations and provides the ability to wirelessly share libraries. With its user-friendly interface and comprehensive features, iTunes continues to be a go-to platform for all things digital media.", "noref_document": "iTunes is a media player, media library, Internet radio broadcaster, and mobile device management application developed by Apple Inc. It was first released on January 9, 2001, and has since become one of the most popular software programs for managing digital media. iTunes allows users to organize and play their music and video files, purchase and download new content from the iTunes Store, and sync their media files with their Apple devices. With features such as a user-friendly interface and a vast library of music, movies, TV shows, podcasts, and more, iTunes has revolutionized the way people consume digital media.", "summary": "iTunes () is a software program that acts as a media player, media library, mobile device management utility, and the client app for the iTunes Store. Developed by Apple Inc., it is used to purchase, play, download, and organize digital multimedia, on personal computers running the macOS and Windows operating systems, and can be used to rip songs from CDs, as well as play content with the use of dynamic, smart playlists. Options for sound optimizations exist, as well as ways to wirelessly share the iTunes library.\niTunes was originally announced by Apple CEO Steve Jobs on January 9, 2001. iTunes' original and main focus was music, with a library offering organization and storage of Mac users' music collections."}
{"entity_string": "https://en.wikipedia.org/wiki/Adobe_Flash_Player", "entity_url": "https://en.wikipedia.org/wiki/Adobe_Flash_Player", "document": "Adobe Flash Player, also known as Shockwave Flash in Internet Explorer, Firefox, and Google Chrome, is a computer software that allows users to view multimedia content, execute rich Internet applications, and stream audio and video content created on the Adobe Flash platform. It can be accessed through a web browser as a plug-in or can run independently on supported devices. Originally developed by FutureWave and known as FutureSplash Player, it was later renamed to Macromedia Flash Player after Macromedia acquired FutureWave in 1996. Following Adobe's acquisition of Macromedia in 2005, it became known as Flash Player, and is now developed and distributed by Zhongcheng for Chinese users, and by Harman International in partnership with Adobe for enterprise users outside of China.", "noref_document": "Adobe Flash Player is a multimedia software platform used for creating and displaying animations, browser games, and streaming video and audio. It was developed and distributed by Adobe Systems until its discontinuation in 2020. Flash Player was once a widely used plugin, enabling interactive multimedia content on various web browsers. However, with the rise of HTML5 technology, which offers better performance and security, Flash has become outdated and vulnerable to security exploits. As a result, major browser vendors have gradually phased out support for Flash, leading to its eventual discontinuation.", "summary": "Adobe Flash Player (known in Internet Explorer, Firefox, and Google Chrome as Shockwave Flash) is  computer software for viewing multimedia contents, executing rich Internet applications, and streaming audio and video content created on the Adobe Flash platform. It can run from a web browser as a browser plug-in or independently on supported devices. Originally created by FutureWave under the name FutureSplash Player, it was renamed to Macromedia Flash Player after Macromedia acquired FutureWave in 1996. It was then developed and distributed by Adobe Systems as Flash Player after Adobe acquired Macromedia in 2005. It is currently developed and distributed by Zhongcheng for users in China, and by Harman International for enterprise users outside of China, in collaboration with Adobe."}
{"entity_string": "https://en.wikipedia.org/wiki/Google+", "entity_url": "https://en.wikipedia.org/wiki/Google+", "document": "Google+, also known as Google Plus or G+, was a social network created by Google in 2011. It aimed to compete with other popular social networks by integrating various Google products such as YouTube, Blogger, and Google Drive. Initially, the platform experienced significant growth and had three Google executives overseeing its operations. However, user engagement and statistics fluctuated. In November 2015, Google+ underwent a major redesign. Unfortunately, due to low user engagement and security concerns regarding potential access to personal information by third-party developers, Google discontinued the Google+ developer API in March 2019. The social network was subsequently shut down for both personal and business use on April 2, 2019.", "noref_document": "Google+ is a social networking platform developed by Google. Launched in 2011, Google+ aimed to provide users with a more organized and customizable platform for connecting with others and sharing content. It introduced features such as Circles, which allowed users to group their contacts into different categories for more targeted sharing. Despite its initial popularity, Google+ faced tough competition from other social media giants such as Facebook and Twitter. Eventually, due to lower user engagement and other factors, Google announced in 2018 that it would be shutting down the consumer version of Google+ in April 2019, while maintaining a version for enterprise customers.", "summary": "Google+ (sometimes written as Google Plus; sometimes called G+) was a social network that was owned and operated by Google until 2019. The network was launched on June 28, 2011, in an attempt to challenge other social networks, linking other Google products like Google Drive, Blogger and YouTube. The service, Google's fourth foray into social networking, experienced strong growth in its initial years, although usage statistics varied, depending on how the service was defined. Three Google executives oversaw the service, which underwent substantial changes that led to a redesign in November 2015.\nDue to low user engagement and disclosed software design flaws that potentially allowed outside developers access to personal information of its users, the Google+ developer API was discontinued on March 7, 2019, and Google+ was shut down for business and personal use on April 2, 2019."}
{"entity_string": "https://en.wikipedia.org/wiki/AOL_Instant_Messenger", "entity_url": "https://en.wikipedia.org/wiki/AOL_Instant_Messenger", "document": "AOL Instant Messenger (AIM) was a widely-used instant messaging program in the late 1990s and early 2000s. It allowed registered users to communicate in real time using the OSCAR and TOC protocols. AIM gained popularity in the United States and other countries, becoming the leading instant messaging application in the region. Teens and college students often utilized the away message feature to keep in touch with friends, frequently changing their messages or leaving them up to inform others of their activities, location, parties, thoughts, or jokes. However, AIM's decline began as AOL subscribers decreased, and it further declined with the rise of Gmail's Google Talk, SMS, and social networks like Facebook. Its fall has been compared with other once-popular internet services like Myspace. In 2015, AOL was acquired by Verizon Communications.", "noref_document": "AOL Instant Messenger, also known as AIM, was a popular instant messaging platform launched in 1997. It allowed users to communicate with contacts through real-time text-based conversations. AIM gained massive popularity in the late 1990s and early 2000s as it provided an easy way for people to connect with friends, family, and colleagues. Users could create screen names, customize their profiles, and participate in chat rooms. AIM also introduced innovative features like file sharing, voice and video chat, and integration with other services. The platform played a significant role in shaping online communication during its prime and had millions of active users. However, with the rise of social media and other messaging apps, AIM's popularity declined, leading to its discontinuation in December 2017. Despite its eventual downfall, AIM remains an iconic symbol of the early internet era.", "summary": "AIM (AOL Instant Messenger) was an instant messaging and presence computer program created by AOL, which used the proprietary OSCAR instant messaging protocol and the TOC protocol to allow registered users to communicate in real time.\nAIM was popular by the late 1990s, in United States and other countries, and was the leading instant messaging application in that region into the following decade. Teens and college students were known to use the messenger's away message feature to keep in touch with friends, often frequently changing their away message throughout a day or leaving a message up with one's computer left on to inform buddies of their ongoings, location, parties, thoughts, or jokes. AIM's popularity declined as AOL subscribers started decreasing and steeply towards the 2010s, as Gmail's Google Talk, SMS, and Internet social networks, like Facebook gained popularity. Its fall has often been compared with other once-popular Internet services, such as Myspace.In June 2015, AOL was acquired by Verizon Communications."}
{"entity_string": "https://en.wikipedia.org/wiki/Sega_Dreamcast", "entity_url": "https://en.wikipedia.org/wiki/Sega_Dreamcast", "document": "The Sega Dreamcast, released in 1998 in Japan and later in other regions, marked an important era in the gaming industry as the first sixth-generation video game console. Developed by an internal Sega team led by Hideki Sato, the Dreamcast was designed with cost reduction in mind, utilizing off-the-shelf components such as a Hitachi SH-4 CPU and an NEC PowerVR2 GPU. To cut expenses, Sega opted for the GD-ROM media format instead of DVD-ROM technology. The Dreamcast ultimately became Sega's final console, bringing an end to the company's almost two-decade-long presence in the console market.", "noref_document": "Sega Dreamcast was a home video game console developed and released by Sega in 1998. It was the first sixth-generation console and offered a range of innovative features and games that garnered significant attention and popularity. The Dreamcast boasted impressive graphics capabilities, online connectivity, and a large library of games across multiple genres. Despite its critical acclaim and cult following, the Dreamcast faced tough competition and struggled to compete with the PlayStation 2, ultimately leading to Sega discontinuing the console in 2001. However, its impact on the gaming industry can still be felt today, with many considering it a pioneer in online gaming and a beloved piece of gaming history.", "summary": "The Dreamcast is a home video game console released by Sega on November 27, 1998, in Japan; September 9, 1999, in North America; and October 14, 1999, in Europe. It was the first sixth-generation video game console, preceding Sony's PlayStation 2, Nintendo's GameCube, and Microsoft's Xbox. The Dreamcast was Sega's final console; its 2001 discontinuation ended the company's eighteen years in the console market.\nAn internal Sega team led by Hideki Sato began developing the Dreamcast in 1997. In contrast to the expensive hardware of the unsuccessful Saturn, the Dreamcast was designed to reduce costs with off-the-shelf components, including a Hitachi SH-4 CPU and an NEC PowerVR2 GPU. Sega used the GD-ROM media format to avoid the expenses of DVD-ROM technology."}
{"entity_string": "https://en.wikipedia.org/wiki/IPod_Classic", "entity_url": "https://en.wikipedia.org/wiki/IPod_Classic", "document": "The iPod Classic, also known as iPod Video or just iPod, was a popular portable media player created and marketed by Apple Inc. It went through six generations, with a spin-off called the iPod Photo that later merged back into the main iPod lineup. All generations utilized a 1.8-inch hard drive for storage. The \"classic\" designation was formally introduced when the sixth-generation iPod was unveiled on September 5, 2007. Before this, all iPod Classic models were simply referred to as iPods. This iconic line of music players was first introduced in 2001, setting the stage for future innovations in portable music consumption.", "noref_document": "The iPod Classic is a portable media player created and marketed by Apple Inc. It was first introduced in 2001 and quickly became a revolutionary device that changed the way people listen to music. With its sleek design, user-friendly interface, and ample storage capacity, the iPod Classic became a must-have gadget for music enthusiasts. It allowed users to carry thousands of songs in their pocket and easily navigate through their music library. The device also popularized the concept of digital music, as it was one of the first devices to support mp3 files and introduced the iTunes platform for purchasing and managing music. Despite advancements in technology and the introduction of newer iPod models, the iPod Classic remains iconic and beloved by many for its timeless design and unparalleled music experience.", "summary": "The iPod Classic (stylized and marketed as iPod classic and formerly iPod Video or just iPod) is a discontinued portable media player created and formerly marketed by Apple Inc.\nThere were six generations of the iPod Classic, as well as a spin-off (the iPod Photo) that was later re-integrated into the main iPod line. All generations used a 1.8-inch (46 mm) hard drive for storage. The \"classic\" suffix was formally introduced with the rollout of the sixth-generation iPod on September 5, 2007. Prior to this, all iPod Classic models were simply referred to as iPods; the first iPod released in 2001 was part of this line that would be called \"Classic\"."}
{"entity_string": "https://en.wikipedia.org/wiki/Google_Glass", "entity_url": "https://en.wikipedia.org/wiki/Google_Glass", "document": "Google Glass, developed by Google's X division, is a brand of smart glasses that aims to produce a ubiquitous computer experience. These glasses offer wearers a head-up display, allowing them to receive and view information effortlessly. By using natural language voice commands, users can communicate with the Internet, making for a hands-free and convenient experience. Initially released as a prototype to \"Glass Explorers\" in the US in 2013, Google Glass later became available to the general public in 2014. Notably, it is equipped with a 5-megapixel camera, capable of capturing high-quality still images and 720p video.", "noref_document": "Google Glass is a wearable technology developed by the search engine giant Google. It takes the form of smart glasses that incorporate augmented reality, allowing users to access information hands-free and interact with the digital world seamlessly. The glasses feature a small transparent display located above the right eye, providing users with notifications, maps, and other visual information in their line of sight. With voice commands and touch gestures, users can take photos, record videos, browse the internet, send messages, and even make video calls. Although the initial version of Google Glass faced various obstacles and was eventually discontinued, it played a significant role in advancing the development of smart glasses and demonstrated the potential of wearable technology in everyday life.", "summary": "Google Glass, or simply Glass, is a brand of smart glasses developed and sold by Google. It was developed by X (previously Google X), with the mission of producing a ubiquitous computer. Google Glass displays information to the wearer using a head-up display. Wearers communicate with the Internet via natural language voice commands.Google started selling a prototype of Google Glass to qualified \"Glass Explorers\" in the US on April 15, 2013, for a limited period for $1,500, before it became available to the public on May 15, 2014. It had an integral 5 megapixel still/720p video camera."}
{"entity_string": "https://en.wikipedia.org/wiki/Kinect", "entity_url": "https://en.wikipedia.org/wiki/Kinect", "document": "Kinect, developed by Microsoft, is a line of motion sensing devices that revolutionized the gaming industry when it was first released in 2010. Unlike its competitors, Kinect does not require physical controllers, making it a standout choice for gamers. Equipped with RGB cameras, infrared projectors, and detectors, Kinect calculates depth using structured light or time of flight calculations. This allows for real-time gesture recognition and body skeletal detection, enabling users to interact with games using their own bodies. In addition, Kinect includes microphones for speech recognition and voice control, enhancing the immersive gaming experience. Initially introduced as a peripheral for the Xbox 360 under the codename \"Project Natal,\" Kinect has since gained popularity and expanded to be implemented in various fields beyond gaming.", "noref_document": "Kinect is a motion sensing input device developed by Microsoft for the Xbox 360 video game console. Released in 2010, Kinect revolutionized the way users interacted with their gaming consoles by enabling them to control games using movements and gestures. Unlike traditional gaming controllers, Kinect uses an array of sensors to capture and track a player's body movements, allowing for a more immersive and intuitive gaming experience. In addition to gaming, Kinect also found applications in various fields such as healthcare, education, and robotics, where its motion tracking capabilities were used for gesture-based controls and motion analysis.", "summary": "Kinect is a line of motion sensing input devices produced by Microsoft and first released in 2010. The devices generally contain RGB cameras, and infrared projectors and detectors that map depth through either structured light or time of flight calculations, which can in turn be used to perform real-time gesture recognition and body skeletal detection, among other capabilities. They also contain microphones that can be used for speech recognition and voice control.\nKinect was originally developed as a motion controller peripheral for Xbox video game consoles, distinguished from competitors (such as Nintendo's Wii Remote and Sony's PlayStation Move) by not requiring physical controllers. The first-generation Kinect was based on technology from Israeli company PrimeSense, and unveiled at E3 2009 as a peripheral for Xbox 360 codenamed \"Project Natal\"."}
{"entity_string": "https://en.wikipedia.org/wiki/PlayStation_Vita", "entity_url": "https://en.wikipedia.org/wiki/PlayStation_Vita", "document": "The PlayStation Vita, also known as the PS Vita or Vita, is a handheld game console developed and marketed by Sony Interactive Entertainment. Released in 2011, it served as the successor to the PlayStation Portable and competes with the Nintendo 3DS. The original model features a 5-inch OLED touchscreen, analog joysticks, and various input options. It supports Bluetooth, Wi-Fi, and optional 3G connectivity. With a quad-core CPU and GPU, the Vita offers powerful performance. Sony later introduced the PS Vita 2000 series with a smaller size, extended battery life, and an LCD screen. Additionally, they released the PlayStation TV, a re-purposed version of the Vita that works like a home video game console. The Vita's design aimed to merge the experience of dedicated gaming platforms with the emerging trend of mobile gaming.", "noref_document": "The PlayStation Vita, often referred to as PS Vita, was a handheld gaming console released by Sony in 2011. It featured a 5-inch OLED touch screen, front and rear cameras, and a touchpad on the back. With its powerful hardware and innovative features, the PS Vita aimed to provide a console-like gaming experience on the go. It had a diverse library of games ranging from popular franchises to indie titles, showcasing its versatility and appeal to a wide audience. Additionally, it supported online multiplayer and allowed users to connect with friends and take part in virtual communities. Despite its impressive capabilities, the PS Vita faced tough competition from smartphones and tablet devices, ultimately leading to its discontinuation in 2019.", "summary": "The PlayStation Vita (PS Vita, or Vita) is a handheld game console developed and marketed by Sony Interactive Entertainment. It was first released in Japan on December 17, 2011, and in North America, Europe, and other international territories beginning on February 22, 2012. The console is the successor to the PlayStation Portable, and a part of the PlayStation brand of gaming devices; as part of the eighth generation of video game consoles, it primarily competed with the Nintendo 3DS.\nThe original model of the handheld includes a 5-inch (130 mm) OLED multi-touch capacitive touchscreen, two analog joysticks, and front and shoulder push-button input, and supports Bluetooth, Wi-Fi, and optional 3G. The Vita features a quad-core ARM Cortex-A9 MPCore CPU and a quad-core SGX543MP GPU. The PS Vita 2000 series, a revised version of the system, was released across 2013 and 2014. It has all of the same features with a slightly smaller size, extended battery life, and an LCD screen instead of OLED. Sony released the PlayStation TV, a short-lived, re-purposed version of the Vita that uses a television screen like a home video game console, discontinued at the end of 2015.\nThe Vita's design was intended to meld the experience of big-budget, dedicated video game platforms with the then up-and-coming trend of mobile gaming as seen on smart phones and tablets."}
{"entity_string": "https://en.wikipedia.org/wiki/Samsung_Galaxy_Note_7", "entity_url": "https://en.wikipedia.org/wiki/Samsung_Galaxy_Note_7", "document": "The Samsung Galaxy Note 7, unveiled in August 2016, was a highly anticipated Android phablet. It introduced several new features to the Galaxy Note series, such as a dual-sided curved display, an iris recognition system, and a USB-C port. Building upon the success of its predecessor, the Galaxy Note 5, the Note 7 also inherited improvements from the Galaxy S7, including expandable storage and IP68 water resistance. One interesting marketing choice Samsung made was branding this device as the \"7th\" in the series instead of \"6th\" to avoid consumer confusion with the flagship Galaxy S7 released in the same year. Unfortunately, the Note 7 was discontinued due to safety concerns regarding its battery overheating issues.", "noref_document": "The Samsung Galaxy Note 7 was a flagship smartphone released by Samsung in 2016. It was highly anticipated due to its innovative features and sleek design. However, the device gained notorious attention for its faulty battery, which led to numerous incidents of explosions and fires. As a result, Samsung had to recall and eventually discontinue the product. This incident served as a cautionary tale for manufacturers, highlighting the importance of rigorous quality control and ensuring the safety of consumers.", "summary": "The Samsung Galaxy Note 7 is a discontinued Android-based phablet designed, developed, produced and marketed by Samsung Electronics. Unveiled on 2 August 2016, it was officially released on 19 August 2016 as a successor to the Galaxy Note 5. It is Samsung's first phone with a USB-C connector, and the last phone in the Galaxy Note series to have a physical home button. Although it is the sixth main device in the Galaxy Note series, Samsung branded its series number as \"7\" instead of \"6\" so consumers would not perceive it as being inferior to the flagship Samsung Galaxy S7, and to prevent confusion about the order of release due to the same release year (2016).\nThe Galaxy Note 7 is an evolution of the Galaxy Note 5 that inherited hardware components and improvements from the Galaxy S7, including the restoration of expandable storage and IP68 water resistance, and new features such as a dual-sided curved display, support for high-dynamic-range (HDR) color, improvements to the bundled stylus and new software features which utilize it, an iris recognition system, and a USB-C port."}
{"entity_string": "https://en.wikipedia.org/wiki/Lytro", "entity_url": "https://en.wikipedia.org/wiki/Lytro", "document": "Lytro, Inc., a pioneering American company founded by Ren Ng in 2006, revolutionized the world of photography with its groundbreaking light-field cameras. In February 2012, Lytro introduced its first generation pocket-sized camera, which allowed users to refocus images even after they were captured. This innovative technology garnered significant attention and generated excitement among photographers and enthusiasts alike. Building on this success, Lytro unveiled its second generation camera, the Lytro Illum, in April 2014. Targeting commercial and experimental photographers, the Lytro Illum showcased enhanced capabilities and advanced features. With a price tag of $1,600, it represented the company's commitment to pushing the boundaries of what was possible in photography.", "noref_document": "Lytro, a computational photography company founded in 2006 by Ren Ng, revolutionized the field with its light field camera technology. Unlike traditional cameras, which capture a single plane of light, Lytro cameras capture the entire light field, allowing users to focus the image after it has been taken. This innovative approach opened up new possibilities in photography, enabling photographers to experiment with depth of field, perspective, and post-processing adjustments. By combining hardware and software advancements, Lytro created a new way of seeing and capturing the world through its light field cameras.", "summary": "Lytro, Inc. was an American company founded in 2006 by Ren Ng which developed some of the first commercially available light-field cameras. Lytro began shipping its first generation pocket-sized camera, capable of refocusing images after being taken, in 8 GB and 16 GB versions on February 29, 2012. In April 2014, the company announced Lytro Illum, its second generation camera for commercial and experimental photographers. The Lytro Illum was released at $1,600."}
{"entity_string": "https://en.wikipedia.org/wiki/Virtual_Boy", "entity_url": "https://en.wikipedia.org/wiki/Virtual_Boy", "document": "The Virtual Boy, developed and manufactured by Nintendo, is a 32-bit tabletop portable video game console that was released in 1995. Marketed as the first console capable of displaying stereoscopic \"3D\" graphics, it revolutionized the gaming experience. By placing the head against the eyepiece, players could see a vivid red monochrome display that enhanced the visual appeal. The games utilized a remarkable parallax effect, which ingeniously created the illusion of depth. Despite the initial anticipation, sales of the Virtual Boy failed to meet expectations. Nintendo made the difficult decision to halt distribution and game development in 1996, ultimately releasing only 22 games for this groundbreaking system.", "noref_document": "The Virtual Boy was a portable gaming console developed and manufactured by Nintendo. Introduced in 1995, it aimed to bring a unique and immersive gaming experience through its stereoscopic 3D display. Unlike traditional gaming devices of the time, the Virtual Boy was designed to be worn on the user's head, providing a personal and isolated gaming experience. The console utilized a red monochromatic display, which created a sense of depth in games but lacked color. Despite its innovative technology, the Virtual Boy was met with mixed reviews and poor sales, leading to its discontinuation just a year after its release. Nevertheless, it remains an intriguing and somewhat overlooked piece of gaming history.", "summary": "The Virtual Boy is a 32-bit tabletop portable video game console developed and manufactured by Nintendo. Released in 1995, it was marketed as the first console capable of displaying stereoscopic \"3D\" graphics. The player uses the console like a head-mounted display, placing the head against the eyepiece to see a red monochrome display. The games use a parallax effect to create the illusion of depth. Sales failed to meet targets, and Nintendo ceased distribution and game development in 1996, having released only 22 games for the system."}
{"entity_string": "https://en.wikipedia.org/wiki/Zune", "entity_url": "https://en.wikipedia.org/wiki/Zune", "document": "Zune, the discontinued line of digital media products and services marketed by Microsoft, aimed to challenge and beat Apple's iPod line, which held an enormous market share at the time. In addition to a series of portable media players created in cooperation with Toshiba, Zune also offered digital media player software for Windows PCs, a music subscription service called \"Zune Music Pass,\" and music and video streaming services for the Xbox 360 game console. Zune's offerings extended beyond the digital realm as it provided music, TV, and movie sales, as well as desktop sync software for Windows Phone. One notable partnership was with United Airlines in 2010, wherein Zune became the provider of music streaming for in-flight entertainment. However, despite its efforts and features, Zune was ultimately discontinued in June 2012.", "noref_document": "Zune is a digital media brand and a line of portable media players that were first introduced by Microsoft in 2006. Although the Zune player was initially a competitor to Apple's iPod, it failed to capture the same level of market success. The Zune offered unique features for its time, such as a larger screen, wireless syncing, and a unique social feature called Zune Social. It also had a subscription-based music service, Zune Pass, which allowed users to access a large library of music for a monthly fee. Despite its innovative features and design, the Zune struggled to compete with the iPod's popularity and was eventually discontinued in 2011.", "summary": "Zune is a discontinued line of digital media products and services marketed by Microsoft from November 2006 until its discontinuation in June 2012. Zune consisted of a line of portable media players, digital media player software for Windows PCs, a music subscription service known as a \"Zune Music Pass\", music and video streaming services for the Xbox 360 game console via the Zune Software, music, TV and movie sales, and desktop sync software for Windows Phone. Zune was also the provider of music streaming for United Airlines in-flight, after a partnership in 2010.\nThe Zune started as a line of portable media players (PMP) created in cooperation with Toshiba. Microsoft aimed to challenge and beat Apple, whose iPod line held an enormous market share."}
{"entity_string": "https://en.wikipedia.org/wiki/3D_television", "entity_url": "https://en.wikipedia.org/wiki/3D_television", "document": "3D television, also known as 3DTV, revolutionized the way viewers experienced television by providing an enhanced sense of depth perception. This technology utilized various techniques like stereoscopic display, multi-view display, and 2D-plus-depth to create a three-dimensional visual experience. Initially, most 3D TV sets used active shutter or polarized 3D systems, while some were even autostereoscopic, eliminating the need for glasses. However, as of 2017, the availability of 3D TV sets and services from manufacturers has significantly declined, indicating a shift in consumer demand and evolving technology trends.", "noref_document": "3D television, a technology that has gained popularity in recent years, refers to the transmission of stereoscopic images to provide viewers with a three-dimensional visual experience. By utilizing various techniques such as polarized glasses or active shutter glasses, 3D TV allows for depth perception, immersing viewers in a more realistic and captivating environment. This innovative technology has been used in various fields including entertainment, gaming, and education, revolutionizing the way we engage with visual media. Despite its initial buzz, the adoption of 3D television has faced challenges due to high costs, the need for compatible content, and issues related to viewer discomfort. However, continuous advancements in display technology and the rise of virtual reality have contributed to the further exploration and development of 3D television, ensuring its continued presence and potential future impact in the entertainment industry.", "summary": "3D television (3DTV) is television that conveys depth perception to the viewer by employing techniques such as stereoscopic display, multi-view display, 2D-plus-depth, or any other form of 3D display. Most modern 3D television sets use an active shutter 3D system or a polarized 3D system, and some are autostereoscopic without the need of glasses. As of 2017, most 3D TV sets and services are no longer available from manufacturers.\n\n\n== History ==\n\nThe stereoscope was first invented by Sir Charles Wheatstone in 1838. It showed that when two pictures are viewed stereoscopically,  they are combined by the brain to produce 3D depth perception."}
{"entity_string": "https://en.wikipedia.org/wiki/Voyager_1", "entity_url": "https://en.wikipedia.org/wiki/Voyager_1", "document": "Voyager 1, a space probe launched by NASA on September 5, 1977, is currently the most distant human-made object from Earth. Having operated for an impressive 46 years and 14 days, it forms a crucial part of the Voyager program designed to explore the outer Solar System and interstellar space beyond the Sun's heliosphere. Communicating through the NASA Deep Space Network, Voyager 1 receives routine commands and transmits valuable data back to Earth. At a distance of 161 AU (24 billion km; 15 billion mi) from Earth as of August 2023, this remarkable probe has completed flybys of Jupiter, Saturn, and Saturn's largest moon, Titan. The choice to prioritize the Titan flyby over Pluto was made due to the former's substantial atmosphere, making it an intriguing subject for exploration.", "noref_document": "Voyager 1 is a space probe launched by NASA in 1977 to study the outer Solar System and beyond. It became the first human-made object to reach interstellar space in 2012, marking a significant milestone in space exploration. Voyager 1 has provided valuable data and images of Jupiter, Saturn, and their moons, giving scientists a better understanding of these distant worlds. It continues to transmit data back to Earth, despite being over 14 billion miles away from the planet. The Voyager 1 mission has inspired awe and curiosity, pushing the boundaries of what we can achieve in space exploration.", "summary": "Voyager 1 is a space probe launched by NASA on September 5, 1977, as part of the Voyager program to study the outer Solar System and interstellar space beyond the Sun's heliosphere. Launched 16 days after its twin Voyager 2, Voyager 1 has been operating for 46 years and 14 days as of September 19, 2023 UTC [refresh]. It communicates through the NASA Deep Space Network to receive routine commands and to transmit data to Earth. Real-time distance and velocity data is provided by NASA and JPL. At a distance of 161 AU (24 billion km; 15 billion mi) from Earth as of August 2023, it is the most distant human-made object from Earth.The probe made flybys of Jupiter, Saturn, and Saturn's largest moon, Titan. NASA had a choice of either doing a Pluto or Titan flyby; exploration of the moon took priority because it was known to have a substantial atmosphere."}
{"entity_string": "https://en.wikipedia.org/wiki/Voyager_2", "entity_url": "https://en.wikipedia.org/wiki/Voyager_2", "document": "Voyager 2, a space probe launched by NASA on August 20, 1977, embarked on an extraordinary journey to explore the outer planets and venture beyond the boundaries of the Sun's heliosphere into interstellar space. Alongside its twin, Voyager 1, it was a part of the ambitious Voyager program. Unlike its sibling, Voyager 2 took a longer trajectory to reach gas giants Jupiter and Saturn but was rewarded with further encounters with the ice giants Uranus and Neptune. Remarkably, Voyager 2 remains the only spacecraft to have ever visited either of these intriguing ice giant planets. Demonstrating its incredible capability, Voyager 2 achieved Solar escape velocity, becoming the third of only five spacecraft to venture beyond the boundaries of our Solar System. During its mission, Voyager 2 successfully fulfilled its primary objective, providing valuable insights into the Jovian, Saturnian, Uranian, and Neptunian systems, unveiling captivating discoveries about these distant worlds.", "noref_document": "Voyager 2 is a space probe that was launched by NASA in 1977. It is part of the Voyager program, along with its sister spacecraft, Voyager 1. Voyager 2 has achieved significant milestones in space exploration, becoming the first spacecraft to provide detailed images of Jupiter, Saturn, Uranus, and Neptune. It has also provided valuable data about the outer planets and their moons, shedding light on their atmospheric composition, magnetic fields, and ring systems. After more than four decades, Voyager 2 continues to travel through interstellar space, providing scientists with invaluable insights into the far reaches of our solar system.", "summary": "Voyager 2 is a space probe launched by NASA on August 20, 1977, to study the outer planets and interstellar space beyond the Sun's heliosphere. As a part of the Voyager program, it was launched 16 days before its twin, Voyager 1, on a trajectory that took longer to reach gas giants Jupiter and Saturn but enabled further encounters with ice giants Uranus and Neptune. Voyager 2 remains the only spacecraft to have visited either of the ice giant planets. Voyager 2 was the third of five spacecraft to achieve Solar escape velocity, which allowed it to leave the Solar System.\nVoyager 2 successfully fulfilled its primary mission of visiting the Jovian system in 1979, the Saturnian system in 1981, Uranian system in 1986, and the Neptunian system in 1989."}
{"entity_string": "https://en.wikipedia.org/wiki/Apollo_11", "entity_url": "https://en.wikipedia.org/wiki/Apollo_11", "document": "Apollo 11, the American spaceflight that successfully landed humans on the Moon, remains an iconic moment in history. In July 1969, Commander Neil Armstrong and Lunar Module Pilot Buzz Aldrin achieved this incredible feat by landing the Apollo Lunar Module Eagle on the lunar surface. Armstrong emerged as the first person to step foot on the Moon, followed by Aldrin shortly after. Together, they spent over two hours venturing around Tranquility Base, the landing site they had named. During their mission, they collected a remarkable 47.5 pounds (21.5 kg) of lunar material to bring back to Earth. Meanwhile, pilot Michael Collins manned the Command Module Columbia, which orbited the Moon. In total, Armstrong and Aldrin spent approximately 21 hours and 36 minutes on the Moon's surface before beginning their journey back to the Command Module. The Apollo 11 spacecraft, launched by a Saturn V rocket from Kennedy Space Center in Florida, consisted of three components: a command module that returned the astronauts to Earth, a service module that provided vital support, and a lunar module with two stages for landing and ascent. The historic mission of Apollo 11 exemplified humanity's spirit of exploration and marked a significant milestone in space exploration.", "noref_document": "Apollo 11 was the famous space mission that landed the first humans on the Moon. Launched by NASA in 1969, Apollo 11 took an 8-day journey, commanded by Neil Armstrong. The spacecraft carried a three-person crew, including Buzz Aldrin and Michael Collins. On July 20, 1969, Neil Armstrong became the first person to step onto the lunar surface, famously declaring, \"That's one small step for man, one giant leap for mankind.\" The mission successfully completed its objectives and returned safely to Earth, marking a significant milestone in space exploration and sparking a renewed interest in the possibilities of human space travel.", "summary": "Apollo 11 (July 16–24, 1969) was the American spaceflight that first landed humans on the Moon. Commander Neil Armstrong and Lunar Module Pilot Buzz Aldrin landed the Apollo Lunar Module Eagle on July 20, 1969, at 20:17 UTC, and Armstrong became the first person to step onto the Moon's surface six hours and 39 minutes later, on July 21 at 02:56 UTC. Aldrin joined him 19 minutes later, and they spent about two and a quarter hours together exploring the site they had named Tranquility Base upon landing. Armstrong and Aldrin collected 47.5 pounds (21.5 kg) of lunar material to bring back to Earth as pilot Michael Collins flew the Command Module Columbia in lunar orbit, and were on the Moon's surface for 21 hours, 36 minutes before lifting off to rejoin Columbia.\nApollo 11 was launched by a Saturn V rocket from Kennedy Space Center on Merritt Island, Florida, on July 16 at 13:32 UTC, and it was the fifth crewed mission of NASA's Apollo program. The Apollo spacecraft had three parts: a command module (CM) with a cabin for the three astronauts, the only part that returned to Earth; a service module (SM), which supported the command module with propulsion, electrical power, oxygen, and water; and a lunar module (LM) that had two stages—a descent stage for landing on the Moon and an ascent stage to place the astronauts back into lunar orbit."}
{"entity_string": "https://en.wikipedia.org/wiki/Pioneer_10", "entity_url": "https://en.wikipedia.org/wiki/Pioneer_10", "document": "Pioneer 10, the NASA space probe launched in 1972, holds the prestigious title of completing the first-ever mission to the planet Jupiter. Not only that, but this remarkable spacecraft also became the pioneer among five planetary probes and eleven artificial objects to successfully attain the escape velocity necessary to venture beyond the boundaries of our Solar System. With its roots at the NASA Ames Research Center in California, Pioneer 10 was specially crafted by TRW Inc. The spacecraft's design revolved around a hexagonal bus, hosting an impressive parabolic dish high-gain antenna measuring a diameter of 2.74 meters (9 ft 0 in). Thanks to its spin stabilization mechanism centered on the axis of the antenna, Pioneer 10 embarked on an extraordinary journey of space exploration.", "noref_document": "Pioneer 10, launched in 1972, was the first spacecraft to travel through the asteroid belt and study Jupiter up close. This pioneering space probe gathered valuable data about the largest planet in our solar system, including its atmosphere, magnetic field, and moons. It also provided us with stunning close-up images of Jupiter, providing scientists with crucial insights about its turbulent atmosphere and stormy surface. Although it has since ceased communication with Earth, Pioneer 10 remains a testament to human curiosity and exploration, paving the way for future deep space missions.", "summary": "Pioneer 10 (originally designated Pioneer F) is a NASA space probe launched in 1972 that completed the first mission to the planet Jupiter. Pioneer 10 became the first of five planetary probes and 11 artificial objects to achieve the escape velocity needed to leave the Solar System. This space exploration project was conducted by the NASA Ames Research Center in California. The space probe was manufactured by TRW Inc.\nPioneer 10 was assembled around a hexagonal bus with a 2.74-meter (9 ft 0 in) diameter parabolic dish high-gain antenna, and the spacecraft was spin stabilized around the axis of the antenna."}
{"entity_string": "https://en.wikipedia.org/wiki/Mariner_4", "entity_url": "https://en.wikipedia.org/wiki/Mariner_4", "document": "Mariner 4, also known as Mariner-Mars 1964, was a pioneering spacecraft in the field of planetary exploration. Launched on November 28, 1964, its primary objective was to conduct closeup scientific observations of Mars and transmit them back to Earth. This mission marked a significant milestone as it became the first spacecraft to successfully flyby Mars, capturing and returning the first close-up images of the Martian surface. These images were a game-changer, revealing a cratered and lifeless planet, thus reshaping the scientific community's understanding of Mars' potential for sustaining life. In addition to image capture, Mariner 4 also aimed to measure fields and particles in interplanetary space near Mars, providing valuable insights and engineering knowledge for future long-duration interplanetary flights.", "noref_document": "Mariner 4 was an interplanetary space probe launched by NASA in 1964. Its main objective was to conduct a flyby mission of the planet Mars and gather information about its atmosphere and surface. Mariner 4 successfully obtained the first close-up images of Mars, revealing a diverse landscape characterized by impact craters, valleys, and volcanic features. These images provided valuable insights into the geology of the Red Planet, leading to a better understanding of its evolution and history. Mariner 4's mission marked a significant milestone in the exploration of Mars and paved the way for future missions to this enigmatic planet.", "summary": "Mariner 4 (together with Mariner 3 known as Mariner-Mars 1964) was the fourth in a series of spacecraft intended for planetary exploration in a flyby mode. It was designed to conduct closeup scientific observations of Mars and to transmit these observations to Earth. Launched on November 28, 1964, Mariner 4 performed the first successful flyby of the planet Mars, returning the first close-up pictures of the Martian surface. It captured the first images of another planet ever returned from deep space; their depiction of a cratered, dead planet largely changed the scientific community's view of life on Mars.  Other mission objectives were to perform field and particle measurements in interplanetary space in the vicinity of Mars and to provide experience in and knowledge of the engineering capabilities for interplanetary flights of long duration."}
{"entity_string": "https://en.wikipedia.org/wiki/Galileo_(spacecraft)", "entity_url": "https://en.wikipedia.org/wiki/Galileo_(spacecraft)", "document": "The Galileo spacecraft, named after the renowned Italian astronomer Galileo Galilei, was an American robotic space probe that embarked on a remarkable mission to study the planet Jupiter and its moons. Delivered into Earth's orbit on October 18, 1989, by the Space Shuttle Atlantis during STS-34, Galileo made its way to Jupiter on December 7, 1995, becoming the first spacecraft to orbit an outer planet. This remarkable feat was achieved after flybys of Venus and Earth, utilizing gravitational assist. The Galileo spacecraft consisted of an orbiter, responsible for collecting data on Jupiter and its moons, and an entry probe. Built by the Jet Propulsion Laboratory and managed by NASA, the Galileo program also relied on the propulsion module supplied by Germany's Messerschmitt-Bölkow-Blohm and the atmospheric probe built by Hughes Aircraft Company, with management by NASA's Ames Research Center. Along its journey, Galileo also studied the asteroids Gaspra and Ida, providing valuable insights into the mysteries of our solar system.", "noref_document": "The Galileo spacecraft was a renowned mission by NASA to explore the Jupiter system. Launched in 1989, it entered orbit around Jupiter in 1995, becoming the first spacecraft to do so. Galileo was equipped with various scientific instruments, including a camera, spectrometer, and magnetometer, which helped to gather data on Jupiter, its moons, and the planet's magnetosphere. Over the course of its mission, Galileo revealed a wealth of information, including the discovery of water vapor plumes on Jupiter's moon Europa, evidence of a subsurface ocean, and insights into the planet's powerful magnetic field. The spacecraft also provided detailed images of Jupiter's atmosphere, capturing stunning views of its bands, vortices, and the iconic Great Red Spot. Despite experiencing technical challenges and limitations, Galileo's mission lasted until 2003, offering valuable scientific discoveries and expanding our understanding of the giant planet and its surroundings.", "summary": "Galileo was an American robotic space probe that studied the planet Jupiter and its moons, as well as the asteroids Gaspra and Ida. Named after the Italian astronomer Galileo Galilei, it consisted of an orbiter and an entry probe. It was delivered into Earth orbit on October 18, 1989, by Space Shuttle Atlantis , during STS-34. Galileo arrived at Jupiter on December 7, 1995, after gravitational assist flybys of Venus and Earth, and became the first spacecraft to orbit an outer planet.The Jet Propulsion Laboratory built the Galileo spacecraft and managed the Galileo program for NASA. West Germany's Messerschmitt-Bölkow-Blohm supplied the propulsion module. NASA's Ames Research Center managed the atmospheric probe, which was built by Hughes Aircraft Company."}
{"entity_string": "https://en.wikipedia.org/wiki/Magellan_(spacecraft)", "entity_url": "https://en.wikipedia.org/wiki/Magellan_(spacecraft)", "document": "The Magellan spacecraft, launched by NASA on May 4, 1989, was a robotic space probe designed to map the surface of Venus using synthetic-aperture radar technology. Weighing 1,035 kilograms (2,282 lb), it was the first interplanetary mission to be launched from the Space Shuttle and the first spacecraft to test aerobraking as a method for orbit circularization. Magellan also marked the successful resumption of U.S. interplanetary probe launches after an eleven-year hiatus. Despite early efforts to develop a budget-friendly Venus Orbiting Imaging Radar mission, Magellan emerged as a significant step in Venus exploration, providing invaluable data on the planet's surface and gravitational field.", "noref_document": "The Magellan spacecraft was a robotic space probe launched by NASA in 1989 to study the planet Venus. Named after the Portuguese explorer Ferdinand Magellan, this remarkable space mission was designed to map the surface of Venus using radar imaging. Magellan's high-resolution radar allowed scientists to observe Venus in unprecedented detail, unveiling vast volcanic plains, towering mountains, and immense craters. With its innovative radar system, Magellan provided crucial insights into the geological history and formation of Venus, helping scientists better understand the planet's unique characteristics and processes.", "summary": "The Magellan spacecraft was a 1,035-kilogram (2,282 lb) robotic space probe launched by NASA of the United States, on May 4, 1989, to map the surface of Venus by using synthetic-aperture radar and to measure the planetary gravitational field.\nThe Magellan probe was the first interplanetary mission to be launched from the Space Shuttle, the first one to use the Inertial Upper Stage booster, and the first spacecraft to test aerobraking as a method for circularizing its orbit. Magellan was the fifth successful NASA mission to Venus, and it ended an eleven-year gap in U.S. interplanetary probe launches.\n\n\n== History ==\nBeginning in the late 1970s, scientists advocated for a radar mapping mission to Venus. They first sought to construct a spacecraft named the Venus Orbiting Imaging Radar (VOIR), but it became clear that the mission would be beyond the budget constraints during the ensuing years."}
{"entity_string": "https://en.wikipedia.org/wiki/Voyager_2", "entity_url": "https://en.wikipedia.org/wiki/Voyager_2", "document": "Voyager 2, a space probe launched by NASA on August 20, 1977, embarked on an extraordinary mission to explore the outer planets and venture into interstellar space beyond the Sun's heliosphere. As part of the Voyager program, it was sent off 16 days ahead of its twin, Voyager 1, following a trajectory that required more time to reach gas giants Jupiter and Saturn but allowed for unprecedented encounters with ice giants Uranus and Neptune. In fact, Voyager 2 still holds the distinction of being the only spacecraft to have ever visited these mesmerizing ice giant planets. As a pioneer in space exploration, Voyager 2 became the third out of five spacecraft to achieve Solar escape velocity, granting it the ability to leave our Solar System. Throughout its journey, Voyager 2 successfully completed its primary mission, visiting the Jovian system in 1979, the Saturnian system in 1981, the Uranian system in 1986, and accomplished its grand finale by exploring the Neptunian system in 1989. Its remarkable accomplishments have provided us with invaluable knowledge about the outer reaches of our celestial neighborhood.", "noref_document": "Voyager 2 is a space probe launched by NASA in 1977 as part of the Voyager program. It is the only spacecraft to have visited all four of the outer planets of the solar system – Jupiter, Saturn, Uranus, and Neptune – and is currently the second furthest human-made object from Earth, after Voyager 1. Voyager 2 has provided scientists with a wealth of invaluable data and stunning images of these distant worlds, revolutionizing our understanding of the outer solar system. This remarkable spacecraft continues to operate and send back valuable information, even after more than four decades of its launch.", "summary": "Voyager 2 is a space probe launched by NASA on August 20, 1977, to study the outer planets and interstellar space beyond the Sun's heliosphere. As a part of the Voyager program, it was launched 16 days before its twin, Voyager 1, on a trajectory that took longer to reach gas giants Jupiter and Saturn but enabled further encounters with ice giants Uranus and Neptune. Voyager 2 remains the only spacecraft to have visited either of the ice giant planets. Voyager 2 was the third of five spacecraft to achieve Solar escape velocity, which allowed it to leave the Solar System.\nVoyager 2 successfully fulfilled its primary mission of visiting the Jovian system in 1979, the Saturnian system in 1981, Uranian system in 1986, and the Neptunian system in 1989."}
{"entity_string": "https://en.wikipedia.org/wiki/Year_2000_problem", "entity_url": "https://en.wikipedia.org/wiki/Year_2000_problem", "document": "The year 2000 problem, also known as the Y2K problem or millennium bug, was a computer issue that arose due to the incorrect formatting and storage of calendar data for dates in and after the year 2000. Many programs represented four-digit years with only the final two digits, which meant that the year 2000 would be interpreted as 1900. This potential error had significant implications for computer-reliant industries worldwide. In the years leading up to the millennium, the general public became increasingly aware of the Y2K scare. Companies estimated that rectifying the bug would cost anywhere between $400 million and $600 billion. The lack of clarity surrounding the bug's potential dangers led some individuals to stockpile essentials, buy firearms, and withdraw large amounts of money. Despite these fears, few major errors actually occurred in 2000.", "noref_document": "The Year 2000 problem, also known as the Y2K bug, was a significant concern in the late 1990s leading up to the new millennium. It revolved around computer systems and software applications that represented years with only two digits, causing potential issues when the year 2000 would be interpreted as 1900 instead. Organizations worldwide embarked on extensive efforts to fix this problem before the clock struck midnight on January 1, 2000. These preparations involved debugging and updating computer systems, testing software for Y2K compatibility, and implementing contingency plans to mitigate potential disruptions. Despite initial fears of widespread chaos, the concerted global effort succeeded, and the new millennium arrived without major Y2K-related problems.", "summary": "The year 2000 problem, also commonly known as the Y2K problem, Y2K scare, millennium bug, Y2K bug, Y2K glitch, Y2K error, or simply Y2K refers to potential computer errors related to the formatting and storage of calendar data for dates in and after the year 2000. Many programs represented four-digit years with only the final two digits, making the year 2000 indistinguishable from 1900. Computer systems' inability to distinguish dates correctly had the potential to bring down worldwide infrastructures for computer reliant industries.\nIn the years leading up to the turn of the century (millennium), the public gradually became aware of the \"Y2K scare\", and individual companies predicted the global damage caused by the bug would require anything between $400 million and $600 billion to rectify. A lack of clarity regarding the potential dangers of the bug led some to stock up on food, water, and firearms, purchase backup generators, and withdraw large sums of money in anticipation of a computer-induced apocalypse.Contrary to published expectations, few major errors occurred in 2000."}
{"entity_string": "https://en.wikipedia.org/wiki/Solar_eclipse_of_August_21,_2017", "entity_url": "https://en.wikipedia.org/wiki/Solar_eclipse_of_August_21,_2017", "document": "The solar eclipse of August 21, 2017, known as the \"Great American Eclipse,\" captivated millions of people across the United States and beyond. This celestial phenomenon offered a unique opportunity for Americans to witness a total solar eclipse, as it created a remarkable path that extended from the Pacific to the Atlantic coast. Crowds gathered in cities and towns along this path to experience the awe-inspiring moment when the moon completely blocked the sun, casting a shadow over the landscape. The eclipse was not limited to the United States; it was visible from Canada's Nunavut region in the north to as far south as northern South America. Even in northwestern Europe, Africa, and northeastern Asia, people were able to catch a glimpse of this extraordinary event––their evening or morning skies graced by a partial eclipse. This historic occurrence truly brought people from around the world together to witness the magnificent beauty of our universe.", "noref_document": "The Solar Eclipse of August 21, 2017, also known as the \"Great American Eclipse,\" was a remarkable celestial event that captivated millions of people across North America. This rare total solar eclipse traversed a path across the United States from the West Coast to the East Coast, providing a unique opportunity for countless skywatchers to witness the moon fully blocking the sun, creating a breathtaking display of darkness in the middle of the day. Many communities within the path of totality organized special events and viewing parties, bringing together people from all walks of life to marvel at this extraordinary cosmic phenomenon. As the first total solar eclipse visible in the contiguous United States since 1979, it sparked excitement and fascination, with professionals and amateur astronomers alike preparing to capture the event through telescopes, cameras, and special viewing glasses. Overall, the Solar Eclipse of August 21, 2017, brought together individuals from different backgrounds to share in the wonderment of our universe and served as a reminder of the awe-inspiring power of nature.", "summary": "The solar eclipse of August 21, 2017, dubbed the \"Great American Eclipse\" by some media, was a total solar eclipse visible within a band that spanned the contiguous United States from the Pacific to the Atlantic coasts. It was also visible as a partial solar eclipse from as far north as Nunavut in northern Canada to as far south as northern South America. In northwestern Europe and Africa, it was partially visible in the late evening. In northeastern Asia, it was partially visible at sunrise.\n\nPrior to this event, no solar eclipse had been visible across the entirety of the United States since June 8, 1918; not since the February 1979 eclipse had a total eclipse been visible from anywhere in the mainland United States."}
{"entity_string": "https://en.wikipedia.org/wiki/2016_United_States_presidential_election", "entity_url": "https://en.wikipedia.org/wiki/2016_United_States_presidential_election", "document": "The 2016 United States presidential election will forever be remembered as a historic moment in American politics. Against all odds, Republican candidate Donald Trump and his running mate Mike Pence secured a victory over the Democratic ticket of Hillary Clinton and Tim Kaine. The election itself was filled with surprises and controversies, with Trump's unconventional campaign style attracting significant media attention. Utilizing a right-wing populist and nationalist platform, Trump promised to \"Make America Great Again\" and criticized issues such as political correctness, illegal immigration, and free-trade agreements. Clinton, on the other hand, became the first female presidential nominee of a major American political party, solidifying her position as a trailblazer in American history. The election showcased the divisions within the country and marked the end of President Barack Obama's tenure, as he was ineligible to pursue a third term according to the Twenty-second Amendment to the US Constitution. Overall, the 2016 presidential election left an indelible mark on the nation's political landscape.", "noref_document": "The 2016 United States presidential election was a historic event that captured the attention of the nation and the world. This election, which took place on November 8, 2016, saw Republican candidate Donald J. Trump face off against Democratic candidate Hillary Clinton. The campaign was marked by intense debates, controversies, and a high level of voter engagement. Ultimately, Donald Trump emerged victorious, securing the presidency and becoming the 45th President of the United States. This election will be remembered for its unprecedented nature, as it highlighted the deep divisions within the country and the significance of political participation.", "summary": "The 2016 United States presidential election was the 58th quadrennial presidential election, held on Tuesday, November 8, 2016. The Republican ticket of businessman Donald Trump and Indiana governor Mike Pence defeated the Democratic ticket of former secretary of state and First Lady of the United States Hillary Clinton and the junior senator from Virginia Tim Kaine, in what was considered one of the biggest political upsets in American history.Incumbent Democratic President Barack Obama was ineligible to pursue a third term due to the term limits established by the Twenty-second Amendment to the US Constitution. Clinton secured the nomination over U.S. senator Bernie Sanders in the Democratic primary and became the first female presidential nominee of a major American political party. Trump emerged as his party's front-runner amidst a wide field of candidates in the Republican primary, defeating U.S. senators Ted Cruz and Marco Rubio, governors John Kasich and Jeb Bush, among other candidates. Trump's right-wing populist, nationalist campaign, which promised to \"Make America Great Again\" and opposed political correctness, illegal immigration, and many United States free-trade agreements garnered extensive free media coverage due to Trump's inflammatory comments."}
{"entity_string": "https://en.wikipedia.org/wiki/Expo_2010", "entity_url": "https://en.wikipedia.org/wiki/Expo_2010", "document": "Expo 2010 Shanghai China, held from 1 May to 31 October 2010, was a remarkable World Expo that took place on both banks of the Huangpu River in Shanghai, China. With the theme \"Better City – Better Life,\" it symbolized Shanghai's emergence as a leading global city in the 21st century. The expo showcased the significance of urban development and sustainable living through various exhibits and pavilions. The iconic Expo emblem featured the Chinese character 世 ('world') creatively transformed to represent three individuals, signifying unity and collaboration, alongside the year 2010. This exposition witnessed an unprecedented number of participating countries and became the most expensive expo in the history of world fairs.", "noref_document": "Expo 2010, also known as the Shanghai World Expo, was a major international exhibition held in Shanghai, China. It took place from May 1 to October 31, 2010, and attracted participants from over 190 countries and international organizations. The theme of Expo 2010 was \"Better City, Better Life,\" focusing on sustainable urban development. The event showcased various pavilions, each representing different nations, showcasing their cultural heritage, technological advancements, and innovative designs. Expo 2010 aimed to promote cultural exchange, economic cooperation, and urban sustainability, leaving a lasting impact on Shanghai's urban landscape.", "summary": "Expo 2010, officially the Expo 2010 Shanghai China, was held on both banks of the Huangpu River in Shanghai, China, from 1 May to 31 October 2010. It was a major World Expo registered by the Bureau International des Expositions (BIE), in the tradition of international fairs and expositions, the first since 2005. The theme of the exposition was \"Better City – Better Life\" and signifies Shanghai's new status in the 21st century as the \"next great world city\". The Expo emblem features the Chinese character 世 ('world', Chinese \"shì\") modified to represent three people together with the 2010 date. It had the largest number of countries participating and was the most expensive Expo in the history of the world's fairs."}
{"entity_string": "https://en.wikipedia.org/wiki/Wedding_of_Prince_William_and_Catherine_Middleton", "entity_url": "https://en.wikipedia.org/wiki/Wedding_of_Prince_William_and_Catherine_Middleton", "document": "The highly anticipated wedding of Prince William and Catherine Middleton took place on April 29, 2011, at the iconic Westminster Abbey in London, England. As second in line to the British throne, Prince William's marriage ceremony with Middleton garnered worldwide attention and interest. The couple's relationship had blossomed since 2003, adding an element of long-lasting commitment to their union. The service was officiated by John Hall, Dean of Westminster, while Rowan Williams, the then Archbishop of Canterbury, conducted the marriage proceedings. The sermon was delivered by Richard Chartres, the then Bishop of London, and a reading was given by Catherine's brother, James. Prince Harry took on the role of William's best man, while the bride's sister, Pippa, assumed the honor of being the maid of honor. The wedding marked a momentous occasion, capturing the hearts and imaginations of people across the globe.", "noref_document": "The wedding of Prince William and Catherine Middleton, also known as the royal wedding, took place on April 29, 2011. It was a highly anticipated event that captured the attention of people worldwide. The ceremony was held at Westminster Abbey in London and was attended by numerous dignitaries, celebrities, and members of the British royal family. The beautiful bride, Catherine Middleton, wore a stunning gown designed by Sarah Burton for Alexander McQueen. The wedding was a lavish affair, with intricate floral arrangements and a grand procession. Millions of people tuned in to watch the televised event, as the couple exchanged vows and embarked on their journey as husband and wife. It was a momentous occasion that marked a new chapter in the British monarchy and captivated audiences around the globe.", "summary": "The wedding of Prince William and Catherine Middleton took place on Friday, 29 April 2011 at Westminster Abbey in London, England. The groom was second in the line of succession to the British throne. The couple had been in a relationship since 2003.\nJohn Hall, Dean of Westminster, presided at the service; Rowan Williams, the then Archbishop of Canterbury, conducted the marriage; Richard Chartres, the then Bishop of London, preached the sermon; and a reading was given by the bride's brother, James. William's best man was his brother, Prince Harry, while the bride's sister, Pippa, was the maid of honour."}
{"entity_string": "https://en.wikipedia.org/wiki/Pioneer_10", "entity_url": "https://en.wikipedia.org/wiki/Pioneer_10", "document": "Pioneer 10, a NASA space probe launched in 1972 by the Ames Research Center in California, embarked on a historic mission to Jupiter. Not only did it successfully complete this mission, but it also achieved a remarkable feat by becoming the first artificial object to reach the escape velocity required to exit the Solar System. This groundbreaking exploration initiative involved the assembly of Pioneer 10 around a hexagonal bus, featuring a 2.74-meter diameter parabolic dish high-gain antenna. To maintain stability during its journey, the spacecraft was spin stabilized around the axis of this antenna. Manufactured by TRW Inc., Pioneer 10 played an instrumental role in advancing our understanding of the outer reaches of the cosmos.", "noref_document": "Pioneer 10 was a NASA spacecraft that marked a significant milestone in space exploration. Launched on March 2, 1972, Pioneer 10 became the first spacecraft to traverse the asteroid belt and successfully reach Jupiter, the largest planet in our solar system. Its primary mission was to gather scientific data about Jupiter and its environment, as well as test the limits of human-made technology in deep space. Equipped with a range of instruments, including cameras and particle detectors, Pioneer 10 provided valuable insights into the Jovian atmosphere, magnetic field, and radiation belts. After completing its mission at Jupiter, Pioneer 10 continued its pioneering journey, becoming the first man-made object to venture out of our solar system and into interstellar space. Although communication with Pioneer 10 was eventually lost in 2003, its legacy lives on as a testament to human curiosity and the boundless possibilities of space exploration.", "summary": "Pioneer 10 (originally designated Pioneer F) is a NASA space probe launched in 1972 that completed the first mission to the planet Jupiter. Pioneer 10 became the first of five planetary probes and 11 artificial objects to achieve the escape velocity needed to leave the Solar System. This space exploration project was conducted by the NASA Ames Research Center in California. The space probe was manufactured by TRW Inc.\nPioneer 10 was assembled around a hexagonal bus with a 2.74-meter (9 ft 0 in) diameter parabolic dish high-gain antenna, and the spacecraft was spin stabilized around the axis of the antenna."}
{"entity_string": "https://en.wikipedia.org/wiki/Mariner_4", "entity_url": "https://en.wikipedia.org/wiki/Mariner_4", "document": "Mariner 4, a spacecraft launched on November 28, 1964, marked a significant milestone in planetary exploration by performing the first successful flyby of Mars. Its primary objective was to conduct closeup scientific observations of the planet, capturing and transmitting these observations back to Earth. Mariner 4 revolutionized our understanding of Mars, as it returned the first close-up pictures ever taken of the Martian surface. These images depicted a cratered, lifeless landscape, challenging the scientific community's previous perceptions of the possibility of life on the planet. Additionally, Mariner 4 aimed to measure fields and particles in interplanetary space near Mars, while also providing valuable knowledge and expertise in long-duration interplanetary flights.", "noref_document": "Mariner 4 was a NASA spacecraft that made history by becoming the first successful mission to Mars. Launched on November 28, 1964, Mariner 4 embarked on a 228-day voyage to the red planet, capturing images and collecting valuable scientific data along the way. On July 14, 1965, it performed a flyby of Mars, coming within 6,118 miles of its surface. The images transmitted back to Earth provided the first close-up view of Mars, revealing a barren landscape with a crater-pocked surface. Mariner 4 revolutionized our understanding of the red planet and paved the way for future missions to explore Mars in greater detail.", "summary": "Mariner 4 (together with Mariner 3 known as Mariner-Mars 1964) was the fourth in a series of spacecraft intended for planetary exploration in a flyby mode. It was designed to conduct closeup scientific observations of Mars and to transmit these observations to Earth. Launched on November 28, 1964, Mariner 4 performed the first successful flyby of the planet Mars, returning the first close-up pictures of the Martian surface. It captured the first images of another planet ever returned from deep space; their depiction of a cratered, dead planet largely changed the scientific community's view of life on Mars.  Other mission objectives were to perform field and particle measurements in interplanetary space in the vicinity of Mars and to provide experience in and knowledge of the engineering capabilities for interplanetary flights of long duration."}
{"entity_string": "https://en.wikipedia.org/wiki/Galileo_(spacecraft)", "entity_url": "https://en.wikipedia.org/wiki/Galileo_(spacecraft)", "document": "Galileo, named after the famous Italian astronomer Galileo Galilei, was an American robotic space probe that explored the mysteries of the largest planet in our solar system, Jupiter, along with its moons and even some asteroids. This groundbreaking spacecraft had two main components, an orbiter and an entry probe. Launched into Earth's orbit on October 18, 1989, by the Space Shuttle Atlantis as part of the STS-34 mission, Galileo utilized gravitational assists from Venus and Earth to reach Jupiter, eventually becoming the first spacecraft to ever orbit an outer planet. The esteemed Jet Propulsion Laboratory was responsible for building the Galileo spacecraft and managing the entire program for NASA. The propulsion module, essential for the spacecraft's movement, was supplied by Messerschmitt-Bölkow-Blohm, a company based in West Germany. Additionally, the atmospheric probe, a crucial aspect of Galileo's mission, was skillfully constructed by Hughes Aircraft Company and managed by NASA's Ames Research Center.", "noref_document": "The Galileo spacecraft was a NASA mission that aimed to study Jupiter and its moons. Launched in 1989, Galileo conducted a series of flybys of asteroids on its way to Jupiter. Once in the vicinity of the gas giant, Galileo began its extensive study of the planet and its moons, taking detailed images and collecting data on their compositions and atmospheres. The spacecraft also deployed a probe called the Galileo Probe, which descended into Jupiter's atmosphere and transmitted valuable information back to Earth. Galileo's mission provided significant insights into the Jovian system, and its data greatly contributed to our understanding of the largest planet in our solar system.", "summary": "Galileo was an American robotic space probe that studied the planet Jupiter and its moons, as well as the asteroids Gaspra and Ida. Named after the Italian astronomer Galileo Galilei, it consisted of an orbiter and an entry probe. It was delivered into Earth orbit on October 18, 1989, by Space Shuttle Atlantis , during STS-34. Galileo arrived at Jupiter on December 7, 1995, after gravitational assist flybys of Venus and Earth, and became the first spacecraft to orbit an outer planet.The Jet Propulsion Laboratory built the Galileo spacecraft and managed the Galileo program for NASA. West Germany's Messerschmitt-Bölkow-Blohm supplied the propulsion module. NASA's Ames Research Center managed the atmospheric probe, which was built by Hughes Aircraft Company."}
{"entity_string": "https://en.wikipedia.org/wiki/Magellan_(spacecraft)", "entity_url": "https://en.wikipedia.org/wiki/Magellan_(spacecraft)", "document": "The Magellan spacecraft, weighing 1,035 kilograms (2,282 lb), was an innovative robotic space probe launched by NASA on May 4, 1989, with the goal of mapping the surface of Venus by employing synthetic-aperture radar and measuring the planetary gravitational field. It holds the distinction of being the first interplanetary mission to be launched from the Space Shuttle, employing the Inertial Upper Stage booster and pioneering the use of aerobraking to circularize its orbit. Magellan successfully broke an eleven-year gap in U.S. interplanetary probe launches and marked the fifth triumphant NASA mission to Venus. Prior to its conception, scientists had initially proposed the Venus Orbiting Imaging Radar (VOIR) spacecraft, but due to budget constraints, a more feasible alternative was sought after.", "noref_document": "Magellan, also known as Venus Radar Mapper, was a spacecraft that was sent by NASA to explore the planet Venus. It was launched on May 4, 1989, and arrived at Venus on August 10, 1990. The main objective of the mission was to map the surface of Venus using synthetic aperture radar (SAR) to penetrate its thick atmosphere and collect data on its topography. Magellan successfully mapped 98% of Venus' surface, revealing fascinating insights into the planet's geological formations, impact craters, and volcanic structures. The mission provided scientists with valuable information about Venus' history and geologic activity, helping to enhance our understanding of Earth's closest planetary neighbor.", "summary": "The Magellan spacecraft was a 1,035-kilogram (2,282 lb) robotic space probe launched by NASA of the United States, on May 4, 1989, to map the surface of Venus by using synthetic-aperture radar and to measure the planetary gravitational field.\nThe Magellan probe was the first interplanetary mission to be launched from the Space Shuttle, the first one to use the Inertial Upper Stage booster, and the first spacecraft to test aerobraking as a method for circularizing its orbit. Magellan was the fifth successful NASA mission to Venus, and it ended an eleven-year gap in U.S. interplanetary probe launches.\n\n\n== History ==\nBeginning in the late 1970s, scientists advocated for a radar mapping mission to Venus. They first sought to construct a spacecraft named the Venus Orbiting Imaging Radar (VOIR), but it became clear that the mission would be beyond the budget constraints during the ensuing years."}
{"entity_string": "https://en.wikipedia.org/wiki/MESSENGER", "entity_url": "https://en.wikipedia.org/wiki/MESSENGER", "document": "MESSENGER, a NASA robotic space probe, successfully orbited the planet Mercury between 2011 and 2015. It conducted an extensive study of Mercury's chemical composition, geology, and magnetic field. The spacecraft's name is derived from the acronym \"Mercury Surface, Space Environment, Geochemistry, and Ranging,\" and pays homage to the messenger god Mercury from Roman mythology. MESSENGER was launched into space aboard a Delta II rocket in August 2004. Its trajectory incorporated a series of flybys, including Earth, Venus, and Mercury itself, to decelerate relative to Mercury while using minimal fuel. With its flyby of Mercury in January 2008, it became the second mission to reach the planet after Mariner 10 in 1975. Finally, MESSENGER successfully entered orbit around Mercury on March 18, 2011, marking a significant milestone as the first spacecraft to achieve such a feat.", "noref_document": "The MESSENGER spacecraft was a NASA mission that was aimed at studying the planet Mercury. Launched in 2004, MESSENGER was the first spacecraft to orbit Mercury and provided invaluable data about the planet's geology, surface composition, and magnetic field, among other things. During its mission, MESSENGER discovered evidence of water ice on Mercury's poles, which was a surprising finding considering the planet's proximity to the Sun. MESSENGER also observed complex geological features such as giant cliffs and volcanic plains, which gave scientists insights into the planet's history and formation. This mission significantly expanded our knowledge and understanding of Mercury and its unique characteristics.", "summary": "MESSENGER was a NASA robotic space probe that orbited the planet Mercury between 2011 and 2015, studying Mercury's chemical composition, geology, and magnetic field.  The name is a backronym for \"Mercury Surface, Space Environment, Geochemistry, and Ranging\", and a reference to the messenger god Mercury from Roman mythology.\nMESSENGER was launched aboard a Delta II rocket in August 2004.  Its path involved a complex series of flybys – the spacecraft flew by Earth once, Venus twice, and Mercury itself three times, allowing it to decelerate relative to Mercury using minimal fuel. During its first flyby of Mercury in January 2008, MESSENGER became the second mission, after Mariner 10 in 1975, to reach Mercury.MESSENGER entered orbit around Mercury on March 18, 2011, becoming the first spacecraft to do so."}
{"entity_string": "https://en.wikipedia.org/wiki/Stardust_(spacecraft)", "entity_url": "https://en.wikipedia.org/wiki/Stardust_(spacecraft)", "document": "Stardust, a 385-kilogram robotic space probe launched by NASA in 1999, embarked on an extraordinary mission that revolutionized our understanding of comets and cosmic dust. Its primary objective was to collect dust samples from the coma of comet Wild 2 and cosmic dust, and bring them back to Earth for analysis. This groundbreaking endeavor marked the first-ever sample return mission of its kind. Along its journey to comet Wild 2, Stardust also made a significant detour to study the asteroid 5535 Annefrank. After a successful completion of its primary mission in January 2006, the spacecraft embarked on a mission extension known as NExT. This exciting continuation culminated in 2011 when Stardust intercepted comet Tempel 1, a small Solar System body that had previously been visited by the Deep Impact mission in 2005. Through its remarkable voyages and invaluable samples, Stardust expanded our knowledge of celestial bodies and contributed to numerous scientific breakthroughs.", "noref_document": "The Stardust spacecraft was a NASA mission designed to study the composition of comets and collect samples of dust from a comet's coma. Launched in 1999, Stardust traveled to the comet Wild 2 and successfully captured cometary particles, becoming the first spacecraft to bring samples from a comet back to Earth. In addition to its primary mission, Stardust also collected interstellar dust grains during its journey. The spacecraft returned to Earth in 2006, delivering its precious cargo to scientists who continue to analyze and study these cosmic samples, providing valuable insights into the origins and nature of our solar system.", "summary": "Stardust was a 385-kilogram robotic space probe launched by NASA on 7 February 1999. Its primary mission was to collect dust samples from the coma of comet Wild 2, as well as samples of cosmic dust, and return them to Earth for analysis. It was the first sample return mission of its kind. En route to comet Wild 2, it also flew by and studied the asteroid 5535 Annefrank. The primary mission was successfully completed on 15 January 2006 when the sample return capsule returned to Earth.A mission extension, codenamed NExT, culminated in February 2011 with Stardust intercepting comet Tempel 1, a small Solar System body previously visited by Deep Impact in 2005."}
{"entity_string": "https://en.wikipedia.org/wiki/2012_phenomenon", "entity_url": "https://en.wikipedia.org/wiki/2012_phenomenon", "document": "The 2012 phenomenon refers to a series of eschatological beliefs that foresaw cataclysmic or transformative events taking place around 21 December 2012. This specific date was considered the end of a 5,126-year-long cycle in the Mesoamerican Long Count calendar. To celebrate this event, festivities were held in countries associated with the Maya civilization, such as Mexico, Guatemala, Honduras, and El Salvador. The main commemorative events took place at Chichén Itzá in Mexico and Tikal in Guatemala. Numerous astronomical alignments and numerological formulae were proposed for this date, sparking various interpretations. Among them, a New Age perspective saw 21 December 2012 as the start of a period of positive transformation for Earth and its inhabitants, while others believed it signaled the end of the world or a similar catastrophic event. Speculations for the world's end ranged from the next solar maximum, interactions between Earth and Sagittarius A* (the supermassive black hole at the center of the galaxy), the Nibiru cataclysm involving a mythical planet crashing into Earth, or even the heating of Earth's core.", "noref_document": "The 2012 phenomenon refers to a range of beliefs and theories surrounding the end of the world or a significant global event that was predicted to occur in the year 2012. This concept gained widespread attention and discussion due to various interpretations of the Mesoamerican Long Count calendar, which marked the completion of a 5,126-year cycle on December 21, 2012. While some individuals feared a doomsday scenario or catastrophic events, others saw it as a time of spiritual transformation and consciousness awakening. Despite the excitement and anticipation leading up to the date, December 21, 2012, passed without any noteworthy apocalyptic incidents, highlighting the range of interpretations and theories associated with the 2012 phenomenon.", "summary": "The 2012 phenomenon was a range of eschatological beliefs that cataclysmic or transformative events would occur on or around 21 December 2012. This date was regarded as the end-date of a 5,126-year-long cycle in the Mesoamerican Long Count calendar, and festivities took place on 21 December 2012 to commemorate the event in the countries that were part of the Maya civilization (Mexico, Guatemala, Honduras, and El Salvador), with main events at Chichén Itzá in Mexico and Tikal in Guatemala.Various astronomical alignments and numerological formulae were proposed for this date. A New Age interpretation held that the date marked the start of a period during which Earth and its inhabitants would undergo a positive physical or spiritual transformation, and that 21 December 2012 would mark the beginning of a new era. Others suggested that the date marked the end of the world or a similar catastrophe. Scenarios suggested for the end of the world included the arrival of the next solar maximum, an interaction between Earth and Sagittarius A*, a supermassive black hole at the center of the galaxy, the Nibiru cataclysm in which Earth would collide with a mythical planet called Nibiru, or even the heating of Earth's core."}
{"entity_string": "https://en.wikipedia.org/wiki/2008_Summer_Olympics", "entity_url": "https://en.wikipedia.org/wiki/2008_Summer_Olympics", "document": "The 2008 Summer Olympics, officially known as the Games of the XXIX Olympiad, were a remarkable international multisport event held in Beijing, China, from 8 to 24 August 2008. It was the first time China had hosted the Olympic Games and marked the third occurrence of the Summer Olympics in East Asia. With 10,942 athletes representing 204 National Olympic Committees, the event showcased the talents and skills of athletes competing in 28 sports and 302 events, one more than the previous Olympics. Beijing's successful bid to host the Games was announced on 13 July 2001 after winning the majority of votes from the International Olympic Committee. This historical event contributed to the rich Olympic heritage of both China and East Asia, while also highlighting the global unity and celebration of sport.", "noref_document": "The 2008 Summer Olympics, officially known as the Games of the XXIX Olympiad, was a major international multi-sport event held in Beijing, China. It kicked off on August 8, 2008, and came to an end on August 24, 2008. The Beijing Games showcased various sports competitions and hosted a record-breaking 11,028 athletes from 204 National Olympic Committees. The event took place in impressive venues, including the Bird's Nest stadium and the Water Cube aquatics center. These Olympics attracted worldwide attention, not only due to the outstanding performances of athletes like Michael Phelps, but also because of China's rich cultural heritage and technological innovations on display during the opening and closing ceremonies. The 2008 Summer Olympics left a lasting legacy for Beijing and highlighted the country's ability to host major international events.", "summary": "The 2008 Summer Olympics (Chinese: 2008年夏季奥运会; pinyin: Èr Líng Líng Bā Nián Xiàjì Àoyùnhuì), officially the Games of the XXIX Olympiad (Chinese: 第二十九届夏季奥林匹克运动会; pinyin: Dì Èrshíjiǔ Jiè Xiàjì Àolínpǐkè Yùndònghuì) and also known as Beijing 2008 (Chinese: 北京2008; pinyin: Běijīng èr líng líng bā), were an international multisport event held from 8 to 24 August 2008, in Beijing, China. A total of 10,942 athletes from 204 National Olympic Committees (NOCs) competed in 28 sports and 302 events, one event more than those scheduled for the 2004 Summer Olympics. This was the first time China had hosted the Olympic Games, and the third time the Summer Olympic Games had been held in East Asia, following the 1964 Olympics in Tokyo, Japan, and the 1988 Olympics in Seoul, South Korea. These were also the second Summer Olympic Games to be held in a communist state, the first being the 1980 Summer Olympics in the Soviet Union (with venues in Russia, Ukraine, Byelorussia, and Estonia).\nBeijing was awarded the 2008 Games over four competitors on 13 July 2001, having won a majority of votes from members of the International Olympic Committee (IOC) after two rounds of voting."}
